#+BEGIN: clocktable :scope file :maxlevel 3 :block thismonth :compact t
#+CAPTION: Clock summary at [2020-07-16 Thu 12:45], for July 2020.
| Headline               |      Time |
|------------------------+-----------|
| *Total time*           | *3d 1:22* |
|------------------------+-----------|
| Agenda Romitex         |      5:28 |
| \_  [2020-07-12 Sun]   |      2:25 |
| \_  [2020-07-13 Mon]   |      0:55 |
| \_  [2020-07-14 Tue]   |      0:30 |
| \_  [2020-07-15 Wed]   |      0:13 |
| \_  [2020-07-16 Thu]   |      1:25 |
| Agenda de estudio      |  2d 19:54 |
| \_  2020-Julio         |  2d 19:54 |
| \_    [2020-07-01 Wed] |      7:30 |
| \_    [2020-07-02 Thu] |      5:27 |
| \_    [2020-07-03 Fri] |      4:41 |
| \_    [2020-07-04 Sat] |      3:45 |
| \_    [2020-07-05 Sun] |      3:21 |
| \_    [2020-07-06 Mon] |      7:20 |
| \_    [2020-07-07 Tue] |      1:53 |
| \_    [2020-07-08 Wed] |      5:00 |
| \_    [2020-07-09 Thu] |      1:51 |
| \_    [2020-07-11 Sat] |      7:32 |
| \_    [2020-07-12 Sun] |      3:17 |
| \_    [2020-07-13 Mon] |      6:06 |
| \_    [2020-07-14 Tue] |      8:11 |
| \_    [2020-07-15 Wed] |      2:00 |
#+END:

[[file:agenda.org][Recordar ver agenda]]

* Agenda Romitex
** [2020-07-12 Sun]
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 14:54]--[2020-07-12 Sun 15:35] =>  0:41
   CLOCK: [2020-07-12 Sun 12:05]--[2020-07-12 Sun 13:49] =>  1:44
   :END:
** [2020-07-13 Mon]
   :LOGBOOK:
   CLOCK: [2020-07-13 Mon 11:54]--[2020-07-13 Mon 12:09] =>  0:15
   CLOCK: [2020-07-13 Mon 10:45]--[2020-07-13 Mon 11:25] =>  0:40
   :END:
** [2020-07-14 Tue]
    :LOGBOOK:
     CLOCK: [2020-07-14 Tue 13:00]--[2020-07-14 Tue 13:30] =>  0:30
    :END:
** [2020-07-15 Wed]
    :LOGBOOK:
   CLOCK: [2020-07-15 Wed 17:12]--[2020-07-15 Wed 17:25] =>  0:13
   :END:
** [2020-07-16 Thu]
   :LOGBOOK:
   CLOCK: [2020-07-16 Thu 11:18]--[2020-07-16 Thu 12:43] =>  1:25
   
   :END:
** [2020-07-17 Fri]
   :LOGBOOK:
   CLOCK: [2020-07-17 Fri 10:18]--[2020-07-17 Fri 12:56] =>  2:38
   :END:      
** [2020-07-18 Sat]
   CLOCK: [2020-07-18 Sat 18:23]--[2020-07-18 Sat 19:40] =>  1:17
   CLOCK: [2020-07-18 Sat 12:26]--[2020-07-18 Sat 12:50] =>  0:24
subiendo seven
* Agenda de estudio
** 2020-Mayo
*** [2020-05-06 mié]
**** desempolvado de la base postgres
:LOGBOOK:
CLOCK: [2020-05-06 mié 16:01]--[2020-05-06 mié 17:53] =>  1:52
:END:
postgres3 y 3-1
**** instalando herramientas para el manejo de postgres
:LOGBOOK:
CLOCK: [2020-05-06 mié 18:25]--[2020-05-06 mié 19:24] =>  0:59
:END:
pgadmin y adminer
30 minutos para instalar adminer por no seguir las instrucciones que
tenia en kubuntu.org, pero tenia las lineas cortadas. Consejo primero
ir a la pagina linkada.
pgadmin3 que viene con 2004 se instala en un minuto pero no sirve
doy por terminado con embole la busqueda de un reemplazo a pgadmin4
que aunque no era bueno era otra opcion para alguna que otra cualidad
que no tenia por ahi.
**** intentando resolver el problema de la funcion gc
:LOGBOOK:
CLOCK: [2020-05-06 mié 19:24]--[2020-05-06 mié 20:34] =>  1:10
:END:
resuelto, sacado los campos que estaban de mas, lo cual alivio la
consulta que paso de tres tablas a una sola. 
**** bonus final del dia
:LOGBOOK:
CLOCK: [2020-05-06 mié 21:00]--[2020-05-06 mié 21:59] =>  0:59
:END:
instale el puto Valentina que parece un muy muy buen sustituto del
pgadmin4.
encontre que los ipprovider con postgres incluido de argentina tienen
precios ridiculamente bajos. y no es solo uno sino que hay varios que
compiten entre si. o sea que hay que ver.
*** [2020-05-07 jue]
**** procurando encryptacion de db
***** descubriendo TDE transparent data encryption postgres
:LOGBOOK:
CLOCK: [2020-05-07 jue 08:30]--[2020-05-07 jue 10:35] =>  2:05
:END:
intente instalar las dos versiones la 12 y la 9, y las dos fallaron en
el make install, con mensajes incomprensibles y cero respuesta en
google. Si bien es cierto que la "solucion" parece la mas acertada, no
parece muy conveniente el modo de acercarse. Seguire investigando.
**** llego a la conclusion de que debo hacer encryption side-client
dos horas perdidas lamentablemente las anteriores.
en el entretiempo lei los distintos enfoques de la encryptacion, y el
enfoque que mas me cuadra es el cliente-side o sea manejar la
encriptacion con tcl yo y mandar la tabla encryptada o con algunos
campos encriptados y listo y hacer el crypt/decrypt en la aplicacion.
[[https://marcopeg.com/2019/per-user-encryption-in-postgres][Blog donde se desarrolla el tema]]
CREATE EXTENSION IF NOT EXISTS pgcrypto;
To encrypt a plain string with a password you can use:

PGP_SYM_ENCRYPT('marco stuff', 'key')::text

To decrypt back to a plain string you can use:

PGP_SYM_DECRYPT(column_name::bytea, 'key')

-- Insert Encrypted
INSERT INTO users (name, data)
VALUES ('marco', PGP_SYM_ENCRYPT('marco stuff', 'key')::text);
-- Read and decrypt
SELECT
	name,
	PGP_SYM_DECRYPT(data::bytea, 'key') as data
FROM users WHERE name = 'marco';
***** encriptando tabla clientes
:LOGBOOK:
CLOCK: [2020-05-07 jue 14:00]--[2020-05-07 jue 14:55] =>  0:55
:END:
****** problemas presentados
******* columna dni cambiado de tipo 
alter table clientes
alter column dni set data type text;
sino no entra el texto codificado
******* se perdera la busqueda por dni
******* se pierde la relacion clientes/calle
**** OTRO ENFOQUE: COMENZAR DE NUEVO
remodelar en serio todo el sistema de tablas e ir haciendolo a medida
que vaya programando, para evitar campos heredados. Y ver como
impactan los problemas.
****** intentare instalar pgmodeler
:LOGBOOK:
CLOCK: [2020-05-07 jue 15:01]--[2020-05-07 jue 15:10] =>  0:09
:END:
sudo apt install pgmodeler
****** dividire la tabla clientes en dos cli_data cli_ex
:LOGBOOK:
CLOCK: [2020-05-07 jue 15:10]--[2020-05-07 jue 16:25] =>  1:15
:END:
y las relaciones con calles iran por id.
Terminado trabajosamente el primer modelo
cli_data/calles/barrios/zonas con los campos adecuados para recibir
los datos encriptados. No pude cargarlo automaticamente pero con 
psql rx -f schema.sql 
lo hago facilmente y rapido y me da info que yo puedo procesar.
****** carga de datos desde romitex.db a set cli_data
:LOGBOOK:
CLOCK: [2020-05-07 jue 17:40]--[2020-05-07 jue 18:45] =>  1:05
CLOCK: [2020-05-07 jue 16:35]--[2020-05-07 jue 17:13] =>  0:38

:END:
haciendo migra1.tcl y renegando con la primer subida.
Realizada la subida de la primera tanda pero sin tener las relaciones
sino no se puede.
Los FK no salen bien en pgmodeler, es mejor hacerlos en VStudio y que
los pasa bien y luego importar el modelo de nuevo en pgmodeler.
*** [2020-05-08 vie]
**** CAMBIO RADICAL===> TO MYSQL
motiva el cambio el que estoy en el verdadero comienzo de todo y la
mayoria de los hosting tienen mysql y no quiero poner palos en la
rueda. Tambien no influye mucho el tema del wraper pq pienso que usar
el tdbc es mas seguro pq viene con el tcl core y es igual hacerlo en
postgres que en mysql, es mas queda abierto a usarlo con los dos.

**** INSTALACION
:LOGBOOK:
CLOCK: [2020-05-08 vie 09:30]--[2020-05-08 vie 10:26] =>  0:56
:END:
sudo apt install mysql-client
mysql -V
mysql -u USERNAME -p PASSWORD -h HOST-OR-SERVER-ip
sudo apt install mysql-server
sudo mysql_secure_installation
sudo emacs /etc/mysql/mysql.conf.d/mysqld.cnf
y cambiar bind-adderess line a 0.0.0.0 desde 127.0.0.1
y asi no podran contactar desde afuera a la base de datos local
sudo systemctl restart mysql
sudo systemctl enable mysql
verificar si esta recibiendo conecciones a 0.0.0.0
con 
ss -ltn
sudo ufw allow from any to any port 3306 proto tcp
[[https://linuxconfig.org/install-mysql-on-ubuntu-20-04-lts-linux][pagina donde se explica el proceso]]
***** creacion de la base de datos
sudo mysql; (como root)
CREATE DATABASE hero;
CREATE USER 'hero' IDENTIFIED BY 'ata';
GRANT ALL PRIVILEGES ON hero.* to hero;
FLUSH PRIVILEGES;
exit;

entro como
mysql -p
y pongo la password
**** reexplorando mytcl
:LOGBOOK:
CLOCK: [2020-05-08 vie 10:30]--[2020-05-08 vie 11:12] =>  0:42
:END:
***** instalando mysql-workbench
[[https://www.how2shout.com/how-to/how-to-install-mysql-workbench-on-ubuntu-20-04-lts.html][Procedimiento para instalar Workbench]]
trabajando con workbench. Creando el nuevo schema e intentando
vincularlo a la base de datos para ver si se puede hacer el camino
viceversa.
hecha la ingenieria forward para ir de diseño a base de datos como el
pgmodeler.
***** hacer el primer script para llenar la tablas con tcl
:LOGBOOK:
CLOCK: [2020-05-08 vie 13:52]--[2020-05-08 vie 14:53] =>  1:01
CLOCK: [2020-05-08 vie 12:08]--[2020-05-08 vie 13:24] =>  1:16
CLOCK: [2020-05-08 vie 11:15]--[2020-05-08 vie 11:46] =>  0:31
:END:
estoy trabado con el autoincrement por un lado y el local data loading
por otro.
****** ERROR: Error in startup script: ::mysql::exec/db server: Loading local data is disabled; this must be enabled on both the client and server sides
SHOW GLOBAL VARIABLES LIKE 'local_infile';
SET GLOBAL local_infile = 'ON'; -- esto como root
SHOW GLOBAL VARIABLES LIKE 'local_infile';
[[https://dba.stackexchange.com/questions/48751/enabling-load-data-local-infile-in-mysql][solucion]]
****** NO TIENE NADA QUE VER EL AUTOINCREMENT EN EL LOAD DATA
****** pude hacerlo manual con mysql -p --local-infile=1
****** MUY IMPORTANTE!!!! LINES TERMINATED BY '\r\n'
lo descubri por casualidad pq el manual decia que era para mac.
****** error en el LOAD DATA POR el local-infile
editar /etc/mysql/mysql.conf.d/mysqld.cnf
agregar al final
[client]  
local_infile=1
eso hace que a nivel server autorice el load-file
****** intento hacer los archivos csv con tcl EXCELENTE!!!!
perfecto!!!
falta ver ahora como funciona con las fk
funcionan bien pero volvi a tener calle,barrio y zona no vale la pena
caer en el tremendo dolor de bolas del id accessiano. Maxime cuando el
update cascade funciona bien
******* me hizo renegar que en la formacion del csv CUIDAR LOS ESPACIOS
no poner "", y las comas terminan el campo o bien el \r\n
p.e. $campo,$campo,$campo\r\n sin dejar espacios sino se traducen en
espacios en blanco en algunos campos no le hace nada pero en otros es
malo.
Y aparte un espacio en el ultimo campo CREA UN NUEVO REGISTRO NULL!!!
****** primer borrador del comando
:LOGBOOK:
CLOCK: [2020-05-08 vie 18:10]--[2020-05-08 vie 19:49] =>  1:39
CLOCK: [2020-05-08 vie 17:00]--[2020-05-08 vie 17:52] =>  0:52
:END:
la idea es un formato tipo browser que sea grande y que la informacion
fluya y que tambien se pueda maximizar sin problemas.
la idea es una barra de busqueda arriba y un gran edit abajo que
sirviera de base para desplegar informacion y un menu que sirviera de
base para todas las funciones.
primera parte terminada. el proyecto comenzo. ahora tengo que releer
bastante el tema text y/o canvas en su defecto.
*** [2020-05-09 sáb]
***** encryptacion de columnas con AES
:LOGBOOK:
CLOCK: [2020-05-09 sáb 09:45]--[2020-05-09 sáb 10:38] =>  0:53
:END:
consegui las funciones encrypt/decrypt de AES y funcionan bien y es
simple el proceso pero no me anda en el simple proceso de CVS-INFILE
pq debe ser que dentro de la cadena encriptada hay comas y me altera
el CVS o sea que hay que buscar otra forma de encryptar.
o sea hacerlo una vez cargada la base en mysql localmente.
***** busqueda de encryptamiento por columna de mysql
:LOGBOOK:
CLOCK: [2020-05-09 sáb 10:38]--[2020-05-09 sáb 11:05] =>  0:27
:END:
doy por concluido momentaneamente el tema por un problema circular.
la columna que contenga el resultado de un AES_ENCRYPT tiene que ser
blob pero si la hago blob el contenido del campo se muestra mal y se
va a encriptar mal. 
Vamos a debilitar el proceso por buscar un tipo de encriptamiento que
no se puede hacer.
***** install phpmyadmin
:LOGBOOK:
CLOCK: [2020-05-09 sáb 12:37]--[2020-05-09 sáb 12:46] =>  0:09
:END:
[[https://www.digitalocean.com/community/tutorials/how-to-install-and-secure-phpmyadmin-on-ubuntu-20-04][pagina que explica]]
***** cambiar text por canvas
:LOGBOOK:
CLOCK: [2020-05-09 sáb 12:46]--[2020-05-09 sáb 13:09] =>  0:23
:END:
***** intentando abrir cuenta gcloud nuevamente
:LOGBOOK:
CLOCK: [2020-05-09 sáb 14:19]--[2020-05-09 sáb 14:32] =>  0:13
:END:
negativo
***** canvas tag
:LOGBOOK:
CLOCK: [2020-05-09 sáb 14:30]--[2020-05-09 sáb 15:23] =>  0:53
:END:
****** que es un tag
es la segunda forma de identificar un objeto. Una es el id que retorna
el create que lo capturamos con una variable y el otro es el o los
tags que le asignamos en -tags.
luego podemos manejarlo a traves de tags.
p.e.
.c delete title ;# borra los elementos que contengan el tag title si
no hay ninguno no da error.
.c itemconfigure title -font {} -fill color etc. ;# le asigna colorido
al tag. el -anchor w es importante en los textos para que se acomoden
bien.
-font {}
-fill color
-anchor w

tambien se pueden hacer bindings.
****** rearmado de tabla clientes
:LOGBOOK:
CLOCK: [2020-05-09 sáb 18:42]--[2020-05-09 sáb 20:50] =>  2:08
CLOCK: [2020-05-09 sáb 16:00]--[2020-05-09 sáb 18:26] =>  2:26
:END:
problemas
******* problemas con los id
si dejo el autonumerico me pone cualquiera lo que me llevaria a
prescindir del idcliente, y cambiar todo con el dni, pero que hago con
el idventas.puedo poner otro campo que contenga el idcliente o el
idventas que no sea el que tenia antes.
******* problemas con la cantidad de registros leidos 36902 vs 39673
al sacarle la coma a la calle quedaban fuera de fk varios registros
entre ellos 52.
y en gran parte solucione casi 3000 registros con hacer el csv con
package require csv
::csv::join [list $l $a $n $f]\r\n
parece que el csv sale mucho mejor parseado y anda feroz
todavia me queda una diferencia de 8 registros que no resuelvo, pq no
encuentro fk de barrios pero habia de ahi tambien

******* problema que agrega una fila NULL SOLVED
creo que es el puts newline del puts file
arreglado con el puts -nonewline
*** [2020-05-10 dom]
**** evaluar el hacer script llano de subida 
:LOGBOOK:
CLOCK: [2020-05-10 dom 09:58]--[2020-05-10 dom 13:17] =>  3:19
:END:
termino la tabla clientes completa primero
DOY POR TERMINADO EL DESARROLLO en mysql pq no es factible hacer el
paso de los datos.
**** reinicio con postgres 
:LOGBOOK:
CLOCK: [2020-05-10 dom 14:04]--[2020-05-10 dom 15:37] =>  1:33
:END:
muy conforme con Adminer, por su rapidez y muy conforme con pgmodeler
tambien por su rapidez y por su interaccion a traves de Diff y con
postgres por su rapidez.
**** veo si puedo poner a full adminer
:LOGBOOK:
CLOCK: [2020-05-10 dom 15:56]--[2020-05-10 dom 16:34] =>  0:38
:END:
negativo - suficiente tiempo perdido. Sin documentacion.
**** hacer la tabla ventas
:LOGBOOK:
CLOCK: [2020-05-10 dom 16:35]--[2020-05-10 dom 17:35] =>  1:00
:END:
**** hacer la tabla pagos
:LOGBOOK:
CLOCK: [2020-05-10 dom 17:47]--[2020-05-10 dom 18:06] =>  0:19
:END:
**** hacer la tabla detalle de venta
:LOGBOOK:
CLOCK: [2020-05-10 dom 18:07]--[2020-05-10 dom 18:16] =>  0:09
:END:
*** [2020-05-11 lun]
**** instalar laravel on ubuntu 20.04
:LOGBOOK:
CLOCK: [2020-05-11 lun 09:32]--[2020-05-11 lun 09:50] =>  0:18
:END:
use el camino sencillo via Composer
[[https://www.osradar.com/install-laravel-ubuntu-2004/][ver pagina donde explica el proceso]]
**** ESTUDIO VIDEO 8
:LOGBOOK:
CLOCK: [2020-05-11 lun 09:55]--[2020-05-11 lun 10:27] =>  0:32
:END:
**** ESTUDIO VIDEO 9
:LOGBOOK:
CLOCK: [2020-05-11 lun 10:35]--[2020-05-11 lun 10:50] =>  0:15
:END:
**** ESTUDIO VIDEO 10
:LOGBOOK:
CLOCK: [2020-05-11 lun 17:27]--[2020-05-11 lun 18:16] =>  0:49
CLOCK: [2020-05-11 lun 10:52]--[2020-05-11 lun 10:57] =>  0:05
:END:
**** hago tabla articulos,artcomprado,caja,ctas
:LOGBOOK:
CLOCK: [2020-05-11 lun 16:50]--[2020-05-11 lun 17:27] =>  0:37
:END:
**** ESTUDIO VIDEO 11
:LOGBOOK:
CLOCK: [2020-05-11 lun 18:16]--[2020-05-11 lun 18:32] =>  0:16
:END:
**** ESTUDIO VIDEO 2-3-4
:LOGBOOK:
CLOCK: [2020-05-11 lun 18:33]--[2020-05-11 lun 19:11] =>  0:38
:END:
**** ESTUDIO VIDEO 12
:LOGBOOK:
CLOCK: [2020-05-11 lun 19:15]--[2020-05-11 lun 19:53] =>  0:38
:END:
**** boludeando con la increible falta de integracion git de sublime
:LOGBOOK:
CLOCK: [2020-05-11 lun 19:50]--[2020-05-11 lun 20:49] =>  0:59
:END:
*** [2020-05-12 mar]
**** ESTUDIO VIDEO 13-14-15
:LOGBOOK:
CLOCK: [2020-05-12 mar 09:25]--[2020-05-12 mar 10:52] =>  1:27
:END:
**** estudio video 16-17
:LOGBOOK:
CLOCK: [2020-05-12 mar 14:47]--[2020-05-12 mar 15:39] =>  0:52
CLOCK: [2020-05-12 mar 14:08]--[2020-05-12 mar 14:30] =>  0:22
:END:
**** estudio video 20 -21 -22 (salteo 18-19)
:LOGBOOK:
CLOCK: [2020-05-12 mar 16:57]--[2020-05-12 mar 18:47] =>  1:50
:END:
**** estudio video 23 y 25 (el 24 no esta)
:LOGBOOK:
CLOCK: [2020-05-12 mar 18:56]--[2020-05-12 mar 20:10] =>  1:14
:END:
*** [2020-05-13 mié]
**** estudio video 26-27 y 28 parcial
:LOGBOOK:
CLOCK: [2020-05-13 mié 18:09]--[2020-05-13 mié 18:24] =>  0:15
CLOCK: [2020-05-13 mié 10:01]--[2020-05-13 mié 11:16] =>  1:15
:END:
**** comienzo el proyecto Romi
:LOGBOOK:
CLOCK: [2020-05-13 mié 21:40]--[2020-05-13 mié 21:53] =>  0:13
CLOCK: [2020-05-13 mié 19:28]--[2020-05-13 mié 21:06] =>  1:38
CLOCK: [2020-05-13 mié 16:05]--[2020-05-13 mié 17:50] =>  1:45
:END:
cree el proyecto
cree el model para clientes
cree la migracion
cree la tabla
migre
genere el controlador
hice una view index funcional paginada con una table en html
me trabe en una view show o edit que levante un solo registro a
discrecion y lo muestre en un formulario basico que ya esta hecho.
subi el proyecto a github.
*** [2020-05-14 jue]
**** prosigo con el proyecto romi
:LOGBOOK:
CLOCK: [2020-05-14 jue 19:10]--[2020-05-14 jue 20:48] =>  1:38
CLOCK: [2020-05-14 jue 17:15]--[2020-05-14 jue 18:51] =>  1:36
CLOCK: [2020-05-14 jue 15:05]--[2020-05-14 jue 16:55] =>  1:50
CLOCK: [2020-05-14 jue 11:12]--[2020-05-14 jue 12:35] =>  1:23
CLOCK: [2020-05-14 jue 10:19]--[2020-05-14 jue 11:08] =>  0:49
:END:
creado layout con el uso de @extends @section @endsection @yield y el
form create todo en 45min. lo unico que no tomo bootstrap pero ya
llegara.
por grandes demoras en delete dentro de postgres hice una tabla
clientes de prueba de 5000 registros desde tcl-migra para las pruebas
que se dumpea instantanea y logre la insercion de registros via
create, solo tengo que resolver el tema del id pq esta usando id bajos
no sigue con los id arriba. (quizas sea un tema para resolver despues
y no trabarse ahora.) Resuelto (ver en troubleshoting) por mis medios.
Avanzo en las otras vistas.
en el tercer tiempo logre:
vistas index con botones edit y delete, vista edit, vista create,
funcionalidad para editar y para borrar, y mejoro filtro con el uso de
DB.
En el cuarto tiempo logre descubrir el error con bootstrap y era un
error de tipeo habia puesto ccs en vez de css.
anda hermoso
ahora fracaso en intentar subir los datos a heroku una bosta, y abro
una cuenta en google cloud. ya abri la cuenta de google cree una db un
usuario subi los datos y nada mas que eso. ahora tendria que ver como
subo la aplicacion tipo heroku y la sirvo desde arriba.
doy por terminado pq tambien instale luego de un primer intento
fallido semantic iu y lo hice funcionar al menos para un widget lo
cual va a requerir muchisimo trabajo de investigacion y puesta a punto
para definir lo que va quedando bien.
*** [2020-05-15 vie]
**** prosigo con el proyecto
:LOGBOOK:
CLOCK: [2020-05-15 vie 20:20]--[2020-05-15 vie 20:32] =>  0:12
CLOCK: [2020-05-15 vie 18:23]--[2020-05-15 vie 19:54] =>  1:31
CLOCK: [2020-05-15 vie 16:55]--[2020-05-15 vie 18:23] =>  1:28
CLOCK: [2020-05-15 vie 15:16]--[2020-05-15 vie 16:30] =>  1:14
CLOCK: [2020-05-15 vie 14:20]--[2020-05-15 vie 15:10] =>  0:50
CLOCK: [2020-05-15 vie 13:05]--[2020-05-15 vie 13:37] =>  0:32
CLOCK: [2020-05-15 vie 09:50]--[2020-05-15 vie 11:45] =>  1:55
:END:
aplicando semantic al proyecto.
de acuerdo a las lecturas de esta mañana me decante por semantic en
desmedro de boostrap
ya hice las vistas create y edit con form nuevos que usan varios
campos por fila.
Terminado y avanzado bastante con semantic ui, bastante facil de
implementar, salvo en la parte script de validacion de form que no la
hice funcionar. Se que los script de js se ponen entre las tags script
pero no funcionan.
Creo que el paso siguiente es seguir con la creacion del modelo de
tablas o sea adquirir mas conocimiento en el manejo de eloquent para
lograr tener la bd postgres igual que la generada y poder traspasar
Los datos correctamente para comenzar a trabajar. - pausa
hice los migrate de tres tablas con sus relaciones, vamos barbaro,
seguire con las tablas a ver como vamos. 
OJO CON LOS ERRORES LA MAYORIA SON ERRORES DE TIPEADO. PERO PIERDO
TIEMPO BUSCANDO EN INTERNET Y NO OBTENGO RESULTADO Y ES PQ EL ERROR ES
MIO.
paso con nullable esta vez pero ha pasado con otras cosas, lo que pasa
que como no sabemos el funcionamiento exacto del programa asumimos que
cualqueir error se debe a algo que no funciona.
Hice la tabla ventas. me animo ahora a hacer la tabla pagos ya que
estoy.
hice todas las tablas que tengo hasta ahora y tambien hice el proyecto
nuevo en github, faltaria hacer los datos en tcl completos para
trabajar ya con toda esa parte.
termine de pasar todo. ahora comienzo un proyecto basico de consulta
de saldo de cliente.
termino funcionando el primer script de js pero falta ahora linkearlo
con los datos en la misma pantalla.
falta menos.
falta teoria.
*** [2020-05-16 sáb]
:LOGBOOK:
CLOCK: [2020-05-16 sáb 16:47]--[2020-05-16 sáb 20:43] =>  3:56
CLOCK: [2020-05-16 sáb 10:30]--[2020-05-16 sáb 12:46] =>  2:16
:END:
primer round hice el datatable.
segundo round intentare subir al gcloud. fallido pq no admite mas que
10000 files y aunque parezca mentira el directorio rom/ tiene 27600
pero gcloud acusaba 12400 como invalido y averigue otra forma que
tambien era inviable por lo complicada.
intente en heroku, bastante bien la subida pq se hace en diez segundos
por git, pero no puedo conectar con la base de datos, a pesar de que
si pude subir los datos mediante psql a pesar de los nombres largos de
db host y usuario.
*** [2020-05-17 dom]
:LOGBOOK:
CLOCK: [2020-05-17 dom 08:39]--[2020-05-17 dom 11:05] =>  2:26
:END:
terminado el objetivo de la semana con la puesta en marcha de la
pagina en la web con heroku.
casi todas las trabas no fueron tales. creia que no andaba la base de
datos y quizas andaba de un principio y era que no se mostraban los
contenidos inseguros a nivel navegador, no tenia nada que ver heroku y
era tan simple como poner en la barra del navegador http en vez de
https. y luego perdi un monton de tiempo pq un bug o no se que de
firefox que me saca de la pagina cuando esta en claro, me hizo pensar
que solo se puede acceder de la ip propia y entonces perdi tiempo
rastreando ese error, y no era tal los otros navegadores no presentan
el error y se puede usar desde claro tambien.
el comun denominador de que un error no existe es que no hay preguntas
para el. puede o no haber respuesta o alguno que diga que no tiene
solucion, pero cuando no hay preguntas es pq estamos ante un
falso-error.
por la presuncion de que algo no anda por desconocimiento.
*** [2020-05-18 lun]
:LOGBOOK:
CLOCK: [2020-05-18 lun 18:04]--[2020-05-18 lun 20:13] =>  2:09
CLOCK: [2020-05-18 lun 17:39]--[2020-05-18 lun 17:50] =>  0:11
CLOCK: [2020-05-18 lun 14:21]--[2020-05-18 lun 17:36] =>  3:15
CLOCK: [2020-05-18 lun 13:29]--[2020-05-18 lun 14:07] =>  0:38
CLOCK: [2020-05-18 lun 12:03]--[2020-05-18 lun 13:25] =>  1:22
CLOCK: [2020-05-18 lun 11:09]--[2020-05-18 lun 11:24] =>  0:15
CLOCK: [2020-05-18 lun 09:33]--[2020-05-18 lun 10:57] =>  1:24
:END:
el plan de trabajo para la semana seria primero terminar de maquetar
la base de datos o sea recorrer toda la bd de sqlite y ver que tablas
van a pasar a postgres y hacer el model. Ahi vamos a saltear un paso y
hacerlo directo con laravel y luego de ultima lo leemos con pgmodeler
para tenerlo visualmente armado.
Termine de hacer todas las tablas con migrate. Ahora paso a pgtcl para
el script migra.
me trabe un monton con la tabla detvta y la relacion con articulos que
tenia un monton de falla pq tenia como cien registros huerfanos.
Opte por no llenarme de datos vanos o sea tablas de registro como
recorridos listados lotesrbos que solo saco las de este año.
termine de subir los datos a heroku y puse en marcha de nuevo la
aplicacion.
por un lado no pude inicializar el script de creacion de tablas no me
dejaba entrar con -f. lo tuve que hacer a mano y me avive tarde que
podia cortar y pegar por trozos grandes. Evite la propiedad de las
tablas pq eso generara conflicto pienso pq no tengo creado un role
dentro.
y por otro lado no tuve que renegar con el tema de la asignacion de la
base de datos a la aplicacion pq lo hizo solo. como dice la
documentacion hacer el addon le asigna el database_url a la app, y en
el log de la app veo atach database y setting database_url y eso lo
hizo solo, no tuve que hacer nada yo. y fui probando la aplicacion y
daba errores compatibles con los status del momento sin existir db,
sin existir la tabla y sin existir los datos y luego largo.
*** [2020-05-19 mar]
:LOGBOOK:
CLOCK: [2020-05-19 mar 17:24]--[2020-05-19 mar 18:07] =>  0:43
CLOCK: [2020-05-19 mar 14:16]--[2020-05-19 mar 17:02] =>  2:46
CLOCK: [2020-05-19 mar 12:37]--[2020-05-19 mar 13:50] =>  1:13
CLOCK: [2020-05-19 mar 12:06]--[2020-05-19 mar 12:36] =>  0:30
CLOCK: [2020-05-19 mar 10:20]--[2020-05-19 mar 11:15] =>  0:55
:END:
primero arreglo problema con tabla pagos que dio un error al cargar a
heroku
me llevo bastante tiempo pero la tabla quedo depurada, me llevo una
hora y media, dos sesiones.
Ahora empiezo a reentrenarme con videos objetivo ponerle auth y
midleware a la aplicacion y hacer un route group.
ya tengo auth, tengo midleware, y estoy probando plantillas de diseño,
aunque la basica que viene con laravel no me disgusta pero las hay mas
profe.
interesante el avance de hoy, pq veo que tendria un esqueleto para
desarrollar en paginas individuales que luego se pondrian u
organizarian en una plantilla adecuada y se regularia por permisos. 
Tambien falta aprender mucho mas de DB y descubri el tinker que es
como una consola que permite probar el eloquent.
*** [2020-05-20 mié]
:LOGBOOK:
CLOCK: [2020-05-20 mié 18:33]--[2020-05-20 mié 21:31] =>  2:58
CLOCK: [2020-05-20 mié 16:53]--[2020-05-20 mié 18:19] =>  1:26
CLOCK: [2020-05-20 mié 14:06]--[2020-05-20 mié 14:30] =>  0:24
CLOCK: [2020-05-20 mié 13:35]--[2020-05-20 mié 13:40] =>  0:05
CLOCK: [2020-05-20 mié 12:36]--[2020-05-20 mié 13:17] =>  0:41
CLOCK: [2020-05-20 mié 12:17]--[2020-05-20 mié 12:36] =>  0:19
CLOCK: [2020-05-20 mié 10:30]--[2020-05-20 mié 11:29] =>  0:59
:END:
la idea es comenzar con la pagina de carga de ventas, la cual sera
lenta pq necesito aprender mucho, es mas anoche lei tres horas, esta
mañana dos.
Lei mucho bootstrap, descarte un formbuilder pq era muy complejo, deje
para mas adelante el midleware para cuando tenga mas paginas y ahora
estoy a pleno con datetables que creo que sera una parte esencial de
mis forms.
*** [2020-05-21 jue]
:LOGBOOK:
CLOCK: [2020-05-21 jue 18:20]--[2020-05-21 jue 21:00] =>  2:40
CLOCK: [2020-05-21 jue 16:29]--[2020-05-21 jue 18:00] =>  1:31
CLOCK: [2020-05-21 jue 13:57]--[2020-05-21 jue 14:50] =>  0:53
CLOCK: [2020-05-21 jue 12:40]--[2020-05-21 jue 13:27] =>  0:47
CLOCK: [2020-05-21 jue 10:00]--[2020-05-21 jue 12:10] =>  2:10
:END:
luego de haber reestudiado la posibilidad de volver a semantic-ui me
decante definitivamente por boostrap pq semantic es un proyecto
muerto.
a bs hay que aprenderlo.
Arreglado tema del repositorio bitbucket que no funcionaba cambiado a
github.
Arreglo la instalacion de awesomplete que la hice mal.
Parece que he dado con un form decente. Ahora quiero tener un js que
me coloree los campos cuando se llenen de datos y que queden en bco
los que no tengan datos.
Me fue mal con los modales de bootstrap irremediablemente hoy un dia
aciago. pero algunas cosas se hicieron, y como siempre algo se
aprendio.
*** [2020-05-22 vie]
:LOGBOOK:
CLOCK: [2020-05-22 vie 18:54]--[2020-05-22 vie 21:00] =>  2:06
CLOCK: [2020-05-22 vie 14:52]--[2020-05-22 vie 18:35] =>  3:43
CLOCK: [2020-05-22 vie 09:58]--[2020-05-22 vie 13:25] =>  3:27
:END:
Conclusiones de este dia largo y aciago:
1 la mas importante de todas, para trabajar en serio firefox para
encontrar los errores, esa consola de debug es impresionante, nada que
ver las otras. Me permitio ver donde estaban los errores y ver que
estaba todo bien y que estaba cometiendo errores de tipeo.

Basicamente el sufrimiento del dia fue al final con ajax, pq no me
funcionaba cuando todo parecia pefecto y era un par de errores que
corregi con firefox que no tenian nada que ver.
esta mañana me hizo renegar un poco el select de semantic asi que tuve
que poner el datatable con bootstrap y no queda mal, y todo lo otro
con semantic, y creo que queda bien. 
Bueno creo que todo es un gran aprendizaje, que quedara plasmado en
las lineas de codigo que se hagan y lo que se aprenda, es imposible
con el cansancio del dia exponerlas aca.
*** [2020-05-23 sáb]
:LOGBOOK:
CLOCK: [2020-05-23 sáb 18:59]--[2020-05-23 sáb 19:25] =>  0:26
CLOCK: [2020-05-23 sáb 17:59]--[2020-05-23 sáb 18:48] =>  0:49
CLOCK: [2020-05-23 sáb 13:07]--[2020-05-23 sáb 17:24] =>  4:17
CLOCK: [2020-05-23 sáb 10:40]--[2020-05-23 sáb 12:44] =>  2:04
:END:
acomododar vim a basico
instalar mozilla firefox for developer
hacer cliente create y cliente delete
estan los dos hechos y funcionan.
cualquier cosita que cambies te puede romper lo que estaba funcionando
bien, por eso es bueno guardar hasta el minimo cambio hecho e ir
probando de a poco cosa por cosa e ir viendo lo que vamos haciendo.
p.e. cosas que me hicieron dejar de funcionar las cosas:
1. las validaciones: hacian que apretar un enter dentro del modal
   crear se saliera y no solo eso sino que recargara la pagina,
   incluso llegue a buscar el error y existia uno igual, y llegue a
   pensar en desechar semantic y volver a bootstrap pensando que era
   una falla de los modales semantic, y es quizas un comportamiento de
   ajax que no admite las validaciones sin recargar la
   pagina.. Solucion me las arreglo con las validaciones de html que
   algo es algo.
2. me olvide de tipear una / en la ruta /cliente/ y figuraba como
   /cliente entonces con un id quedaba /cliente281 y decia que era
   desconocida la ruta.
3. acceso unautorizado. y era pq no estaba logueado, pq yo puse un
   midleware a todo el controller clientes entonces no podia ir alli.
y quizas otros que no me acuerdo. Pero lo que pasa es que como uno no
sabe lo que hace y lo que no hace el sistema enseguida pasas a buscar
la solucion como si algo anduviera mal.
Estos errores y la lentitud del proceso te hacen dudar un poco pero
creo que es un proceso irreversible pq no puedo volver atras, ya estoy
en el medio de algo que tengo que dominarlo si o si.

Semantic Calendar vs Firefox Calendar pienso que gana firefox por el
momento pq es lindo y es out the box.

esta la mitad del pasar ventas, faltan los articulos que es lo mas
dificil, veremos como lo solucionamos.
*** [2020-05-24 dom]
:LOGBOOK:
CLOCK: [2020-05-24 dom 18:21]--[2020-05-24 dom 19:17] =>  0:56
CLOCK: [2020-05-24 dom 15:58]--[2020-05-24 dom 17:08] =>  1:10
:END:
decidi hacer un curso intensivo de javascript para estar en mejores
condiciones de encarar el trabajo. por eso no se vera reflejado aca en
el horario pero es un monton de horas desde las siete de la mañana que
vengo con esto.
*** [2020-05-25 lun]
:LOGBOOK:
CLOCK: [2020-05-25 lun 19:03]--[2020-05-25 lun 20:12] =>  1:09
CLOCK: [2020-05-25 lun 16:17]--[2020-05-25 lun 18:30] =>  2:13
:END:
instalando gitkraken para ver si tengo el manejo de git fuera del
editor y puedo volver a sublime text. Gitkraken bosta fallo pq no
admite repositorios privados.
termine instalando git-cola que es bastante completo y visual y
opensource.
El problema que tengo con sublime que cuando lo abro la maquina
empieza a chillar.

Hoy a sido el segundo dia del curso intensivo de java.
Poco y nada pude hacer de avances en la pagina. Es exasperante que de
todo lo supuestamente aprendido nada haya podido sacarse de
practica. Bueno algo si, p.e. pude hacer el addEventListener para el
campo sex y que ante el evento change pusiera el value a mayusculas, y
eso habilita a cualquier otra correccion de validacion por eventos o
de manejo por eventos. Y aunque pude hacer que se notara el evento a
traves de los elementos hijos del formulario no pude hacer que
cambiaran de clase como para irse coloreando a medida que vayan
avanzando, se podria probar de nuevo.
Tuve buen exito con el datalist que me parece una buena solucion para
los combos aunque agrega un teclaso mas que awesomplete pq el otro
funciona con el enter, es codigo html puro y no depende de terceros
sino de mi mismo, y creo que no me colisionaria con el dibujo del
formulario lo que me permitiria tener labels. lo cual no es poca
cosa. o sea datalist con un teclazo mas pero con labels y anchos
correctos vs awesomplete con un solo enter pero sin label y sin
formato. sumado a sin instalacion extra de nada vs tener que instalar
una libreria extra.

Solo llevo dos dias en plan de aprendizaje, como suspendiendo el
desarrollo para aprender, y aprendi mucho, creo bastante sobre arrays,
objetos, dom, y creo que es una base, creo que debo destinarle una
semana a la capacitacion intensa y despues ver si me deposita en un
estadio mas arriba.
*** [2020-05-26 mar]
:LOGBOOK:
CLOCK: [2020-05-26 mar 17:17]--[2020-05-26 mar 18:28] =>  1:11
CLOCK: [2020-05-26 mar 10:48]--[2020-05-26 mar 13:53] =>  3:05
:END:
hoy comence a ver Vue.js como posible alternativa para front-end pero
primero tengo que terminar la base de js.
Excelente el resultado hasta ahora de lo que voy haciendo con js. me
sirve de practica y tambien en los resultados.
Por alguna razon no funcionaron los eventos de Form submit o blur y
entonces hice la funcion de limpiar campos atada al boton crear.
*** [2020-05-27 mié]
:LOGBOOK:
CLOCK: [2020-05-27 mié 18:27]--[2020-05-27 mié 18:42] =>  0:15
CLOCK: [2020-05-27 mié 16:39]--[2020-05-27 mié 18:01] =>  1:22
CLOCK: [2020-05-27 mié 10:21]--[2020-05-27 mié 13:29] =>  3:08
:END:
excelentisima practica con el fetch datacreate.
bastante bien tambien el tema de la seleccion del articulo y el
agregado del articulo el form paso de ventas que creo que esta
expresado en su funcionalidad, faltan detalles pero creo que va a
andar.
Falta mucho por aprender todavia. 
*** [2020-05-28 jue]
:LOGBOOK:
CLOCK: [2020-05-28 jue 17:14]--[2020-05-28 jue 18:06] =>  0:52
CLOCK: [2020-05-28 jue 15:04]--[2020-05-28 jue 16:03] =>  0:59
CLOCK: [2020-05-28 jue 14:00]--[2020-05-28 jue 14:18] =>  0:18
CLOCK: [2020-05-28 jue 11:01]--[2020-05-28 jue 13:13] =>  2:12
:END:
anoche pense una nueva forma de trabajar con los videos. Escucha mas
activa con toma de apuntes, pero apuntes no con formato prettyfy para
consulta ulterior sino como guia para practica inmediata en la
maquina, bajo la premisa que si lo aprendido no se practica no se
fija, y luego de ultima hacer un apunte de repaso que bien podria ser
hecho en org, que puede ser consultable mas rapido mientras
programamos y de ultima releible si actualizamos orgmode en el movil.
Avance hermoso con las validaciones y no quise seguir metiendole
tiempo por si acaso con vue se hacen cosas mas grosas, total lo hecho
es para fijar conocimientos. De ultima donde me trave que es cuando
creia que las regex no funcionaban era pq habia puesto mal el nombre
del elemento en el getElementById o sea un error muy infantil.
*** [2020-05-29 vie]
:LOGBOOK:
CLOCK: [2020-05-29 vie 18:46]--[2020-05-29 vie 20:06] =>  1:20
CLOCK: [2020-05-29 vie 17:32]--[2020-05-29 vie 18:44] =>  1:12
CLOCK: [2020-05-29 vie 15:27]--[2020-05-29 vie 17:27] =>  2:00
CLOCK: [2020-05-29 vie 13:50]--[2020-05-29 vie 15:25] =>  1:35
CLOCK: [2020-05-29 vie 11:25]--[2020-05-29 vie 12:53] =>  1:28
CLOCK: [2020-05-29 vie 09:53]--[2020-05-29 vie 11:23] =>  1:30
:END:
hora y media perdida en un intento de practica con laravel mix que
resulto fallida pq no me anduvo, esta bien que el sistema esta muy
sucio tiene muchas cosas instaladas y reinstaladas, tendria que
empezar de nuevo de cero y terminar de definir el tema
boostrap-semantic y otras cosas y pasar en limpio.
Fecunda hora y media con practica de Vue, aunque uno se traba en los
detalles se van sacando de a poco y se va puliendo la tecnica, pero
creo que tengo que ir haciendo video/maquina en el momento, no me
sirve adelantar videos pq no gano nada, salvo que realmente no pueda
estar en la maquina y quiera avanzar.
Hora y media bastante perdidita tambien pq intente hacer nuevamente no
se si por tercera vez los modales de bootstrap y no me salieron, menos
mal que tengo fomantic sino estaria frustrado, quise separar las
modales en blades separadas mediante extends y no me funciono el
javascript entonces todo de nuevo, lo unico bueno fue que la
validacion de los campos de combo se hicieron en un pelin.
Alto reniegue estas dos horas, con una sola leccion de vue!!! y encima
incompleta con las faltas de semantic.
y quise instalar semantic en un directorio de laravel de prueba y me
trabe mil con gulp, increible. hasta que por fin di que funcionara .
Por lo menos una hora perdida pero pude instalar semantic, pero mal
muy mal la perdida de tiempo.
Un poco mejor el ultimo tramo pq recupere la visual de semantic y
aprendi que con un componente de vue se pueden hacer muchas cosas.
*** [2020-05-30 sáb]
:LOGBOOK:
CLOCK: [2020-05-30 sáb 19:20]--[2020-05-30 sáb 20:08] =>  0:48
CLOCK: [2020-05-30 sáb 18:36]--[2020-05-30 sáb 19:02] =>  0:26
CLOCK: [2020-05-30 sáb 17:38]--[2020-05-30 sáb 18:31] =>  0:53
CLOCK: [2020-05-30 sáb 16:18]--[2020-05-30 sáb 17:03] =>  0:45
CLOCK: [2020-05-30 sáb 14:55]--[2020-05-30 sáb 15:23] =>  0:28
CLOCK: [2020-05-30 sáb 12:10]--[2020-05-30 sáb 13:04] =>  0:54
CLOCK: [2020-05-30 sáb 10:35]--[2020-05-30 sáb 11:41] =>  1:06
CLOCK: [2020-05-30 sáb 09:39]--[2020-05-30 sáb 10:19] =>  0:40
:END:
1er tramo: perdido experimentando con toast. Lamentablemente no
funciona, jquery no la acepta pero no anda en boostrap tampoco, anoto
mas en troubleshoting.
2do tramo: bastante bien aprovechado pq vi dos videos y voy avanzando
en vue, y a la vez voy viendo como aprender semantic para no quedar
demasiado desfasado, o sea ir haciendo con semantic lo que el otro va
haciendo con boosta.
3er tramo: fecundo aprendi el inicio de Vuex, resolviendo un error
solo yendo a la documentacion por un error que cometio el que hizo el
video.
4to tramo fecundo con dos lecciones bien aprendidas de vue.
5to tramo bastante fecundo tambien avanzando ya instale vue-cli y
vamos bien.
6tro tramo instale fomantic de nuevo como practica con semantic-vue en
la vue y lo pude hacer de una. pero me trabo mucho en la teoria con
semantic.
7m0 avanzo bastante en ambos conceptos, en vue va la inmersion y en
semantic averigue dos cosas que la pagina de fomantic usa una version
de jquery 3.11 fija, y otra que usando un poco de css simple basico se
puede obviar todo el tema margin top, center y muchas huevaditas que
le pedimos a booster.
*** [2020-05-31 dom]
:LOGBOOK:
CLOCK: [2020-05-31 dom 21:17]--[2020-05-31 dom 22:00] =>  0:43
CLOCK: [2020-05-31 dom 17:03]--[2020-05-31 dom 17:49] =>  0:46
CLOCK: [2020-05-31 dom 16:23]--[2020-05-31 dom 16:26] =>  0:03
CLOCK: [2020-05-31 dom 15:42]--[2020-05-31 dom 15:57] =>  0:15
CLOCK: [2020-05-31 dom 14:39]--[2020-05-31 dom 15:41] =>  1:02
CLOCK: [2020-05-31 dom 12:02]--[2020-05-31 dom 14:08] =>  2:06
:END:
Despues de 3horas 8 minutos de reniegue descubri que search de
semantic necesita que el campo busqueda se llame title, entre otras
cosas como hacerme mi propio json. pero aprendi un monton pienso.
Hoy fue un dia que se fue en la prueba y ensayo del search de
semantic, y a la mañana en la capacitacion con semantic, donde aprendi
esto que felizmente lo saque y los themes que no los practique, y
ademas agregue toast para laravel para reemplazar los toast que no
funcionan de semantic. Y asi vamos agregando funcionalidades. Lo
importante es ir aprendiendo cada vez mas, pq con los reniegues se va
acrecentando el conocimiento acumulado.
** 2020-Junio
*** [2020-06-01 lun]
:LOGBOOK:
CLOCK: [2020-06-01 lun 21:49]--[2020-06-01 lun 22:31] =>  0:42
CLOCK: [2020-06-01 lun 19:45]--[2020-06-01 lun 20:14] =>  0:29
CLOCK: [2020-06-01 lun 18:43]--[2020-06-01 lun 19:45] =>  1:02
CLOCK: [2020-06-01 lun 18:10]--[2020-06-01 lun 18:28] =>  0:18
CLOCK: [2020-06-01 lun 15:35]--[2020-06-01 lun 16:12] =>  0:37
CLOCK: [2020-06-01 lun 14:50]--[2020-06-01 lun 15:34] =>  0:44
CLOCK: [2020-06-01 lun 14:20]--[2020-06-01 lun 14:50] =>  0:30
CLOCK: [2020-06-01 lun 12:37]--[2020-06-01 lun 13:11] =>  0:34
CLOCK: [2020-06-01 lun 11:09]--[2020-06-01 lun 12:34] =>  1:25
:END:
creado laravel-vue-spa con gran problematica con npm run dev resuelto
en troubleshooting. 
visto video 18 de vue donde profundizamos la creacion de rutas para
construir un SPA single page aplication. 
Esta mañana lei sobre blaze (reemplazo de vue) y meteor (reemplazo de
laravel) y por suerte no profundice en ese camino que es opuesto a lo
que vengo haciendo. y anoche lo dedique a foundation que en cierta
forma parece abordable pero es de muy dificil compaginacion con los
otros proyectos es decir laravel y vue. mucho peor que  tener que
incluir semantic.
Investigando sobre alternativas a semantic que no me cierra por su
falta de mantenimiento y su complejidad. O sea si ya es un proyecto
abandonado, imaginate que no puedo desarrollar con el. Yo en cierta
forma estoy desarrollando ahora para los proximos años no puedo
basarme en algo que da errores que no tiene mantenimiento. Por mas que
tenga algunas caracteristicas lindas. 
El proyecto tiene un movimiento de desarrollo impresionante en la
actualidad por lo cual, creo que no hay que pensarlo mucho, sin
problemas de integracion al menos en el proyecto de vue con vuikit.
No es mas linda pero no es fea, y parece muy solida, y es liviana
segun la descripcion. Hay que seguir investigando pero se puede creo
avanzar mejor con eso.
Desafortunadamente el search y el datapicker lo tenian en la version 2
y ahora la tres esta vigente y no lo han pasado, pero es una
produccion que esta vigente incluso hay pedidos para que se
pase. habria que ver.
Despues de unas pruebas vi que UIkit es muy liviano y muy funcional y
es muy lindo, simple y no recargado. Incluso me funciono sin
instalacion solo poniendo las referencias en el documento lo cual es
interesante.
Rehice el ejemplo de vue que tan mas aspecto habia tenido con semantic
y en pocos minutos con UIkit con solo linkar los archivos sin
instalacion tampoco logre algo bien bonito, y eso que no tengo
practica y que solo llevo pocos minutos en esto.
*** [2020-06-02 mar]
:LOGBOOK:
CLOCK: [2020-06-02 mar 18:35]--[2020-06-02 mar 20:40] =>  2:05
CLOCK: [2020-06-02 mar 17:41]--[2020-06-02 mar 17:57] =>  0:16
CLOCK: [2020-06-02 mar 14:52]--[2020-06-02 mar 17:25] =>  2:33
CLOCK: [2020-06-02 mar 13:17]--[2020-06-02 mar 14:20] =>  1:03
CLOCK: [2020-06-02 mar 11:19]--[2020-06-02 mar 12:03] =>  0:44
CLOCK: [2020-06-02 mar 10:22]--[2020-06-02 mar 11:19] =>  0:57
:END:
descubri esta mañana Bulma y me parece buena opcion, primero pq esta
en pleno y seguro desarrollo es muy usado por 200000 developers.
y es themeable en monton. hay que aprenderlo.
Hoy a sido un dia dificl pq pase de descubrir Bulma a la mañana, Buefy
a la siesta y Vuefity a la tarde, y ahora no se que voy a hacer. Me
gusta mas Bulma pero hay casi nula documentacion, tanto en video como
en web para seguir adelante. Lo que esta casi finiquitado es que debo
terminar de aprender vue con la practica, y en eso los videos de
vuetify a pesar de ser especificos son vue, y te arrojan practica,
Creo que un par de dias mas tengo que seguir aprendiendo. 
Creo que el mejor descubrimiento del dia fue el escuchar los videos a
una velocidad mayor, 1.25/1.50 o hasta 1.75 lo cual hace que se pueda
avanzar mas rapido y aprovecharlos mejor sin aburrirse.
Lo mismo todavia no he cumplido un mes de programacion y creo que he
avanzado un monton.
*** [2020-06-03 mié]
:LOGBOOK:
CLOCK: [2020-06-03 mié 16:58]--[2020-06-03 mié 20:02] =>  3:04
CLOCK: [2020-06-03 mié 15:32]--[2020-06-03 mié 16:24] =>  0:52
CLOCK: [2020-06-03 mié 14:23]--[2020-06-03 mié 15:30] =>  1:07
CLOCK: [2020-06-03 mié 12:45]--[2020-06-03 mié 13:58] =>  1:13
CLOCK: [2020-06-03 mié 10:56]--[2020-06-03 mié 12:08] =>  1:12
:END:
Ayer decidi definitivamente quedarme con Buefy porque opto por el
diseño bulma. Lo veo mas simple y liviano que el otro. Y los
resultados son lindos en ambos escenarios y dependen de la experiencia
en la maquetacion y en el arte, que no viene con el programa sino que
lo pone uno.
primera hora repasando lo basico de vue, y bastante arme un cuadro en
mi mente.
Luego de renegar por una hora instalo de nuevo una instalacion limpia
la unica que encontre que es la de CRETUEUSEBIU que se llama
laravel-vue-spa en github.
voy a empezar a trabajar sobre eso.
Hoy el balance es mitad y mitad, un poco desalentado pq no puedo
empezar a codificar ni tampoco estoy en el medio de una clara etapa de
capacitacion, y es porque no se veia bien el camino, habia que
establecer cual era la plataforma donde ibamos a construir, o sea
hacer la platea.
Y creo que con el boilerplate que consegui logre algo limpio sin
errores de instalacion que me da la posibilidad de trabajar con vue y
hacer un spa con buefy.
Pude iniciar el navbar, esta trabado un poco el tema de las auth con
santum que parece ser un problema general, pero se puede ir
resolviendo despues, y me queda por aprender en lo inmediato como
conseguir datos por medio de vue, que creo que es por axios. Y alli
ver si el haber trasvasado todas las migraciones sirve, si hay que
hacer una fresh y recargar los datos, o sea todas esas cosas. 
*** [2020-06-04 jue]
:LOGBOOK:
CLOCK: [2020-06-04 jue 20:02]--[2020-06-04 jue 21:40] =>  1:38
CLOCK: [2020-06-04 jue 18:58]--[2020-06-04 jue 20:02] =>  1:04
CLOCK: [2020-06-04 jue 15:17]--[2020-06-04 jue 18:40] =>  3:23
CLOCK: [2020-06-04 jue 12:41]--[2020-06-04 jue 12:50] =>  0:09
CLOCK: [2020-06-04 jue 12:07]--[2020-06-04 jue 12:35] =>  0:28
CLOCK: [2020-06-04 jue 11:18]--[2020-06-04 jue 11:28] =>  0:10
CLOCK: [2020-06-04 jue 10:34]--[2020-06-04 jue 11:16] =>  0:42
CLOCK: [2020-06-04 jue 09:35]--[2020-06-04 jue 10:34] =>  0:59
:END:
logre un punto de partida limpio vamos a ver que pasa.
por el momento quiero tirar todo a la mierda, es que estoy varado
cuando no entiendo y estoy solo, y me abruma lo complejo, pero no es
moco de pavo. ejemplo un navbar de bulma. que ni siquiera lo lei y lo
quiero implementar asi al copy y pegue.
Dia muy peleado, con mucha frustracion, en algunos momentos me da
ganas de abandonar. Pq pienso que esto es algo muy grande y dificil de
lograr, pensar que estoy trabado todo el dia en cosas muy chiquititas
y con cero apoyo del mundo exterior. Si que se esta aprendiendo y en
el camino se estan fijando mucho los conocimientos del sistema para
hacerlo algo que uno domine, pero es arduo.
Hoy por lo menos hice un sccafoling completo que me gusta como base pq
es puro y sin errores basado en una instalacion basica para vue de
laravel y el agregado de algunos archivos a mano y nada mas. la guia
la tengo bookmarkeada. hice las migraciones, logre conexion a datos
que es lo que me preocupaba, logro una lista via ul/li en pantalla,
posiblmente logre un componente para mi propio autocompletado, pero no
logro poner en marcha el autocompletado de buefy y eso me frustra pq
no le encuentro la vuelta por los putos arrays de javascript, que dan
trabajo pero lo buenisimo es que encontre un camino facil via rutas y
controladores para sacar datos via axios sin problemas, creo que hay
que seguir adelante sin trabarse demasiado pq sino va a ser muy
frustrante.
Pero el dia viendolo en perspectiva es de mucho avance.
*** [2020-06-05 vie]
:LOGBOOK:
CLOCK: [2020-06-05 vie 18:52]--[2020-06-05 vie 19:50] =>  0:58
CLOCK: [2020-06-05 vie 18:44]--[2020-06-05 vie 18:51] =>  0:07
CLOCK: [2020-06-05 vie 18:15]--[2020-06-05 vie 18:23] =>  0:08
CLOCK: [2020-06-05 vie 18:06]--[2020-06-05 vie 18:12] =>  0:06
CLOCK: [2020-06-05 vie 17:29]--[2020-06-05 vie 17:58] =>  0:29
CLOCK: [2020-06-05 vie 15:49]--[2020-06-05 vie 17:18] =>  1:29
CLOCK: [2020-06-05 vie 13:24]--[2020-06-05 vie 13:28] =>  0:04
CLOCK: [2020-06-05 vie 10:30]--[2020-06-05 vie 13:05] =>  2:35
:END:
Por lo menos hoy despues de tanto renegar tuve suerte con el
datalist. primero me baje un datalist casero que funciona gracias a
cuatro componentes individuales, y luego pensando se me prende la
lampara que falta algo en php para que funcione y ahi recuerdo el
video y lo pongo y sas era un archivo en composer que maneja el
tablelist. 
Despues empiezo a renegar con la interface en si para emular lo hecho
con lo anterior pero dentro de un SPA y con lo que pueda conseguir
luego con vue, nada mas y nada menos que eso.  Por lo demas pienso
seguir usando jquery. Y pienso que axios funciona joya, y descubri con
las rutas que se puede acceder facil al servidor.
El reto era hacer el control de texto y boton de busqueda en bulma y
lo logre en 30minutos. Asimismo no conseguir que funcionara la columna
y lo hice con style al ancho.

objetivo: centrar un poco el contenido:(6min): el error era que ponia
class conteiner y es class container. funciona barbaro.
10min perdidos en buscarle la vuelta a ver si habia un error en el
tema de las columnas y no hay caso, no funciona para el input. hasta
me pregunto si funciona para el input.
Fenomeno!! un minuto mas y lo descubri, es a nivel class control lleva
is-expanded y alli se nota cuando el input en este caso o el widget
que este en esa clase se expandira hasta usar el ancho de la columna.
7min creados los tres botones editar/crear/borrar clientes muy lindos
con field is-grouped
58min de reniegue con el modal obtengo: se inicializo bien el modal,
funciona no hay problemas. pero no puedo dar ancho con columnas ni con
buefy ni con bulma, debe ser un problema del componente y ahi si que
estoy restringido con buefy no tengo tanta libertad como con
uielement. No queda feo el modal, funciona bien, es chiquito, pero los
anchos los tengo que calcular a ojo con style y darlos a pixels y no
son responsives, o sea no van a funcionar en el celular. No habria que
trabarse tanto pienso pq con el paso del tiempo algo aprendere de
nuevo, no puedo frenarme aca. Salvo que desista de usar modales y me
incline a otra solucion como hacerla en la pagina tipo el formulario
de tcl. y deje los modales para ventanitas de servicio. Habria que
probar si en la pagina entera y lisa puedo hacer bien el formulario.
Como resumen el dia pienso que anduvo bien, hice funcionar el
componente calle, para buscar el combo, hice funcionar el datatable,
hice el campo buscador y empece con los modales y anduvieron, pero
falta seguir encontrando la vuelta.
*** [2020-06-07 dom]
:LOGBOOK:
CLOCK: [2020-06-07 dom 20:20]--[2020-06-07 dom 20:46] =>  0:26
CLOCK: [2020-06-07 dom 18:19]--[2020-06-07 dom 20:14] =>  1:55
CLOCK: [2020-06-07 dom 17:03]--[2020-06-07 dom 17:28] =>  0:25
CLOCK: [2020-06-07 dom 16:05]--[2020-06-07 dom 17:02] =>  0:57
:END:
despues de la decepcion y de las ganas de tirar todo por unos errores
inesperados en el datatable me vuelve la confianza al haberlos
resuelto con conocimientos propios que se van acumulando y eso es lo
importante pq no hay una guia escrita paso a paso, sino que hay que
aprender por el camino duro.
Despues de dos horas de aislamiento logre poner al dia copiando y
pegando mayormente con relativo exito pq puedo arreglar lo que hice,
lo que tenia antes y avanzar un poco. Quedo trabado en el autocomplete
por el momento que lamentablemente el de jquery no funciona.
Hasta ahora todo igual el desarrollo salvo que estoy dentro del
sistema de una spa, y he juntado bastantes conocimientos diversos,
como para saber renegar mejor, pero no creo que todo vaya a ser vue,
aunque debo seguir aprendiendo eso.
*** [2020-06-08 lun]
::LOGBOOK:
CLOCK: [2020-06-08 lun 19:20]--[2020-06-08 lun 21:40] =>  2:20
CLOCK: [2020-06-08 lun 17:54]--[2020-06-08 lun 19:20] =>  1:26
CLOCK: [2020-06-08 Mon 14:55]--[2020-06-08 lun 15:23] =>  0:00
CLOCK: [2020-06-08 lun 14:55]--[2020-06-08 lun 15:23] =>  0:28
CLOCK: [2020-06-08 lun 14:22]--[2020-06-08 lun 14:54] =>  0:32
CLOCK: [2020-06-08 lun 13:15]--[2020-06-08 lun 13:58] =>  0:43
CLOCK: [2020-06-08 lun 12:48]--[2020-06-08 lun 13:13] =>  0:25
CLOCK: [2020-06-08 lun 11:29]--[2020-06-08 lun 12:03] =>  0:34
CLOCK: [2020-06-08 lun 11:14]--[2020-06-08 lun 11:28] =>  0:14
CLOCK: [2020-06-08 lun 10:59]--[2020-06-08 lun 11:13] =>  0:14
CLOCK: [2020-06-08 lun 10:51]--[2020-06-08 lun 10:59] =>  0:08
CLOCK: [2020-06-08 lun 09:14]--[2020-06-08 lun 10:50] =>  1:36
:END:
falta validaciones / autocomplete / guardar/ borrar / editar/
solucionar el bug-problema de que al hacer enter se borran los
contenidos de los campos.
1ro autocomplete. 1hs30min de reniegue total, llego a la conclusion
que el autocomplete de buefy anda completamente bien, pero no muestra
el combo, en la inspeccion con vue tiene el array filtrado correcto
pero no muestra el combo. Tampoco lo hace con un ejemplo simple
copiado. Es como que mi pagina no lo permite.
8min muy felizmente!! en 8 minutos encaje la implementacion de mi!!
datalist en buefy... con v-for de vue. 
14min: termine de extender a las otras dos barrios y zonas el sistema.
14min: problema de que borra los campos: no solucionado pero acotado:
lo hace el enter y el tab tambien, pero sucede la primera vez luego de
reiniciar, las subsiguientes veces funciona normal de acuerdo a lo
esperado.
Por lo tanto lo dejo como un bug a resolver despues.
34min+25min perdidos buscando la solucion a adaptar la validacion, se
agrega aparte de los errores que se cometen en el cortar y pegar, una
capa de perfeccionamiento pq es mas estricto en el requerimiento de
variables, y dejo pendiente la validacion de calle/barrio/zona por no
contar con acceso a los arrays de datos en forma facil, y para no
duplicar prefiero esperar a tener mas conocimiento, quizas con vuex.
43m salvando crear clientes +32min renegando. no funciona FormData que
recibe el form correctamente pero no levanta los pares de valores y no
entrega nada. En rom funciona bien y entrega todos los valores, sin
los valores el fetch no se hace. obviamente. 
28min mas descubri el problema es que FormData arma sus valores con el
atributo name de los campos.
1.30hs prueba con buscadorpg anda bien le faltan pocas cosas para ser
enteramente funcional, incluso podriamos sacarle cosas obsoletas
mayormente cuadros de informacion que no se usan mas, creo que en un
par de dias lo tengo funcionando a pleno pulido, ...peero con heroku
no funciona fluidamente, el delay es impresentable y no permitiria
trabajar en produccion. Asi que instale de nuevo una instancia en
google y estoy subiendo una base pg nuevamente para probar rendimiento
en google.
Si tengo el pasador de ventas y el de recibos y fundamentalmente el
fichas creo que en cuestion de unos pocos dias, digamos una o dos
semanas se podria ir a produccion lo que facilitaria enormemente el
desarrollo futuro del proyecto, pq Fede pasaria parte de los papeles
sino todos y yo tendria full time para programar.
2:20hs    :estoy desempolvando el fichas, y ojo el problema de las
incompatibilidades mayormente es el cambio de tablas y campos que le
hice a postgres, fijarse primero en eso antes de alterar cualquier
cosa.
Me decepciona tambien la lentitud de google, apenitas un poquito por
debajo de heroku.
Creo que iremos rapido y antes de fin de mes tenemos que estar en la
nube o al menos en postgres.
Tambien pienso que hay una de dos repuestas al problema del delay: o
es normal en las bases de datos en la nube, o es un problema de
programacion, por el tipo de pedido de datos que hago y que pueda ser
corregido en todo caso. Lo llamativo es que cuando hice las pruebas el
año pasado en el centro andaba bien y no fue problematica la velocidad
al contrario era absolutamente normal salvo en la generacion de las
fichas en la cual se notaba bastante el trabajo de datos y por eso
hice el wrap con sqlite.
No me molesta trabajar en el proyecto tcl primero al contrario me da
gusto tener dos opciones. Hay una diferencia atroz con la instancia de
san pablo frente a la iowa/heroku, como proporcional a la distancia
recorrida.
Pero tambien noto una diferencia con relacion a una busqueda con el
buscador y una impresion de cien fichas, no tiene relacion, Hay algo
que anda mal en el buscador, tendria que revisar el algoritmo para ver
si hay algo que corregir, desde mañana lo reviso y comienzo a
programar algo mas sencillo.
*** [2020-06-09 mar]
:LOGBOOK:
CLOCK: [2020-06-09 mar 19:29]--[2020-06-09 mar 19:48] =>  0:19
CLOCK: [2020-06-09 mar 17:56]--[2020-06-09 mar 18:17] =>  0:21
CLOCK: [2020-06-09 mar 15:16]--[2020-06-09 mar 16:39] =>  1:23
CLOCK: [2020-06-09 mar 14:18]--[2020-06-09 mar 14:53] =>  0:35
CLOCK: [2020-06-09 mar 12:03]--[2020-06-09 mar 13:45] =>  1:42
CLOCK: [2020-06-09 mar 08:28]--[2020-06-09 mar 11:52] =>  3:24
:END:
probando tiempos en las distintas bases de datos y de paso repasando
como borrar y recargar base de datos en la nube.
3:24min de un tiron 221 lineas de codigo. una estructura de busqueda
muy completa y visual, que funciona muy bien con iowa.
1.42 sigo llegue a las 345 ldc y logre solucionar el cuello de botella
de la generacion de la tabla cuotas, haciendolo con sqlite on memory.
genial. funciona en heroku.
35+1:23 llegue a las 606 ldc obvio que hay mucho cortar y pegar en
estas ultimas etapas pq hay funciones enteras que funcionan bien y los
pego los reviso y van.
Dejo de funcionar heroku con un error que lo he encontrado en internet
incluso en la misma pagina de ellos. como que interpretaran que el uso
que le da el programa mio es inseguro y dieron de baja el acceso a la
base de datos. 
21min di de baja heroku, por malos, me quedo con google, a pesar del
precio, no existe algo que sea bueno y sea barato, lamentablemente. 
Ya esta la primer parte ahora quiero poner en la parte de abajo mas
info para tener todo en primera plana, comentarios, devoluciones,
relaciones, visitas?, intimaciones?, subidas al seven?. Todo en el
balance de informacion y que no sea pesada la pagina al cargarse. Los
analisis cuadros y demas los quiero presentar en otra ventana no
quiero tenerlos en la misma. Quiero que los programas sean solo
operativos.
Muy buen avance hoy con el buscador. 
*** [2020-06-10 mié]
:LOGBOOK:
CLOCK: [2020-06-10 mié 20:00]--[2020-06-10 mié 20:29] =>  0:29
CLOCK: [2020-06-10 mié 17:59]--[2020-06-10 mié 19:54] =>  1:55
CLOCK: [2020-06-10 mié 16:05]--[2020-06-10 mié 16:21] =>  0:16
CLOCK: [2020-06-10 mié 15:55]--[2020-06-10 mié 16:03] =>  0:08
CLOCK: [2020-06-10 mié 13:10]--[2020-06-10 mié 13:44] =>  0:34
CLOCK: [2020-06-10 mié 11:57]--[2020-06-10 mié 13:04] =>  1:07
CLOCK: [2020-06-10 mié 11:50]--[2020-06-10 mié 11:52] =>  0:02
CLOCK: [2020-06-10 mié 11:23]--[2020-06-10 mié 11:49] =>  0:26
CLOCK: [2020-06-10 mié 10:10]--[2020-06-10 mié 11:15] =>  1:05
CLOCK: [2020-06-10 mié 10:00]--[2020-06-10 mié 10:08] =>  0:08
CLOCK: [2020-06-10 mié 09:25]--[2020-06-10 mié 09:59] =>  0:34
:END:
encarar edicion - planes de pago - devoluciones - comentarios
luego los tbls extras que pretendo para abajo siempre que no
ralenticen la carga.
34min edicion y comentarios sobre toda la aplicacion, pude observar lo
bueno que son los comentarios, uno nunca sabe cuando va a volver sobre
el codigo, y los comentarios son mas que bienvenidos. 
8min hice condonacion y comentarios y suspendo para hacer triggers en
la base de datos para terminar de verificar los condonados.
1:10 puse todas las funciones y los triggers felizmente estaban
guardados y funcionan y tambien hice la edicion de venta. Falta
resumen de cuenta, devolucion y plan de pago.
26min devoluciones y planes de pagos.
En 10hs tengo el buscador funcional basico, faltaria ver comentarios y
direcciones viejas y relaciones en la pantalla de abajo.
1hs resubi la base a brasil con las funciones y triggers y funciona
perfecto, y agregue las tres tbls abajo y anda todo bien incluso
relaciones tiene doble click.
Me gustaria un atajo para volver al cliente anterior. Hecho.
Me gustaria que cuando uno busca y en el tbls aparece un solo
resultado se busque sin mas.
5min terminado - eso agiliza un monton las busquedas. 
15min cambie el algorritmo del boton volver para poder volver
indefinidamente de ida y vuelta, o sea no borrando los links para
poder ir y volver.
1:55 se empezo con el pasar ventas, se lo recupero, se corrigio la
base de datos para eso. Se agrego una tabla nueva art_ventas y de paso
se puso a punto el sistema migra1.tcl para generar la base de datos
completamente con funciones y con generacion de datos (como que
condonados=1 tienen que tener saldo 0, o poner clientes.pagado igual a
la suma de pagos, etc.). O sea un update generalizado de comienzo.
Perdi media hora mas pq para que funcione el script tuve que poner que
borrara las funciones pq sino daba error.
*** [2020-06-11 jue]
:LOGBOOK:
CLOCK: [2020-06-11 jue 19:25]--[2020-06-11 jue 20:22] =>  0:57
CLOCK: [2020-06-11 jue 18:15]--[2020-06-11 jue 19:24] =>  1:09
CLOCK: [2020-06-11 jue 14:35]--[2020-06-11 jue 15:18] =>  0:43
CLOCK: [2020-06-11 jue 12:21]--[2020-06-11 jue 13:20] =>  0:59
CLOCK: [2020-06-11 jue 11:23]--[2020-06-11 jue 11:36] =>  0:13
CLOCK: [2020-06-11 jue 10:27]--[2020-06-11 jue 11:09] =>  0:42
CLOCK: [2020-06-11 jue 09:47]--[2020-06-11 jue 10:26] =>  0:39
:END:
comenzar con el problema de pmovto pienso el problema de la funcion se
da con las ventas nuevas pq no da tiempo que se genere el idvta o algo
asi.
de ultima poner la fecha de primera que ese es el pmovto de una venta
recien hecha.
hay que revisar el trigger ahi.
40min- descubierto Lumen probando primeras impresiones. es una version
lite de laravel con muchos menos archivos, que puede ser todalmente
funcional y mucho mas rapida. No estaria mal probarla y ver si podemos
desarrollar alli, debido a las caracteristicas de la api que
necesitamos nosotros.
42min termine de optimizar ventaspg arregle el tema pmovto era lo que
decia estaba mal el trigger, el pmovto de una cuenta nueva es primera,
no tiene sentido llamar a pmovto(). 
-Estudiar volver a tener la tabla cuotas en pg para generar al toque
sin demasiada carga de software cliente el simple array de cuotas. 
-Estudiar tambien el no tener tabla cuotas pero usar la funcion gc.
Me falta el campo cuota en tabla clientes, que vendria a ser: 
update clientes set cuota=(select sum(ic) from ventas where
idcliente=clientes.id)
update clientes set cuota=(select sum(ic) from
ventas where saldo>0 and idcliente=clientes.id)
1.10hs terminado el cuadro principal de info que se necesita con pasar
ventas que es el que maneja las zonas.
1hs -un poco de boludeo con lumen...bastante bien, logre hacer
funcionar las rutas y los controladores y obtener datos, lo que tengo
que lograr ahora es dominar el array que entra y poder mostrarlo en
pantalla con foreach e ir paso a paso.
*** [2020-06-12 vie]
:LOGBOOK:
CLOCK: [2020-06-12 vie 17:35]--[2020-06-12 vie 17:50] =>  0:15
CLOCK: [2020-06-12 vie 16:42]--[2020-06-12 vie 17:20] =>  0:38
CLOCK: [2020-06-12 vie 10:27]--[2020-06-12 vie 12:30] =>  2:03
:END:
2hs : comenzando con cobrpg.tcl terminada la vista, terminados muchos
detalles de rbospg incluso con una practica de pasado completo,
triggers pagos.
38min -boludeando con lumen pude instanciar vue, y hacer un get con
axios aunque tuve que poner el scr para vue y para axios, hice un
v-for y presente los datos con un {{}} lo que veo es que no veo
dificil la ejecucion de rutas para nada, menos el trabajo con los
controllers y empezar a trabajar con vue despues. 
15min puse en marcha stockpg.tcl el ultimo que faltaba.
*** [2020-06-13 sáb]
:LOGBOOK:
CLOCK: [2020-06-13 sáb 15:46]--[2020-06-13 sáb 17:53] =>  2:07
:END:
con ruby rails- muy positiva la experiencia pude comenzar la migracion
de dos tablas desde cero cargarla con datos y trabajar, falta ahora
teoria. 
*** [2020-06-14 dom]
:LOGBOOK:
CLOCK: [2020-06-14 dom 12:10]--[2020-06-14 dom 12:56] =>  0:46
:END:
*** [2020-06-15 lun]
:LOGBOOK:
CLOCK: [2020-06-16 mar 12:15]--[2020-06-16 mar 12:15] =>  0:00
CLOCK: [2020-06-15 lun 17:30]--[2020-06-15 lun 19:34] =>  2:04
CLOCK: [2020-06-15 lun 14:59]--[2020-06-15 lun 16:53] =>  1:54
CLOCK: [2020-06-15 lun 13:56]--[2020-06-15 lun 14:47] =>  0:51
CLOCK: [2020-06-15 lun 11:16]--[2020-06-15 lun 13:20] =>  2:04
:END:
Hice todas las migraciones de la base de datos en rails, todo normal,
salvo los nombres de algunas pocas tablas, como paso con el otro
sistema, que para no seguir alterando las aplicaciones se pueden usar
vistas tranquilamente y eso tendria que haber usado desde un comienzo.
La unica dificultad que veo hasta ahora es que los procesos de update
de estado, que envuelven gran trabajo con triggers que en las otras
bases funcionan perfecto, aca demoran una barbaridad como que hubiera
algun proceso que ralentizara al maximo las cosas. Incluso ahora que
estoy creando un index sobre la tabla ventas(idcliente) esta tomando
un tiempo muy largo, frente al de otras bases, en las otras toma un
segundo, aca toma varios minutos y lo cancele, no se pudo hacer.
Descubierto el misterio: los indices, las tablas ventas y pagos tenian
indices sobre idcliente e idvta, fundamentalmente el de idcliente hace
la diferencia, no se en que lugar del migration laravel lo agregamos
al indice, pero aca los updates sin indices se hacen insoportablemente
lentos y con indices son ultrarapidos y la base funciona igual que las
otras. Ahora tengo que releer todo de nuevo para entender a fondo lo
que tenemos que hacer, para que el backend funcione a pleno antes de
querer agregar algo de frontend.
*** [2020-06-16 mar]
:LOGBOOK:
CLOCK: [2020-06-16 mar 18:30]--[2020-06-16 mar 19:31] =>  1:01
CLOCK: [2020-06-16 mar 15:48]--[2020-06-16 mar 16:24] =>  0:36
CLOCK: [2020-06-16 mar 13:44]--[2020-06-16 mar 14:04] =>  0:20
CLOCK: [2020-06-16 mar 12:21]--[2020-06-16 mar 12:40] =>  0:19
CLOCK: [2020-06-16 mar 11:35]--[2020-06-16 mar 12:15] =>  0:40
CLOCK: [2020-06-16 mar 09:56]--[2020-06-16 mar 11:18] =>  1:22
:END:
una hora veinte muy basicas tratando de comprender yo solo el
funcionamiento de rails para new/create. con el form hecho con
erb. problemas con el scope y los params. pero ya esta visto. 
40min corrigiendo el fichas.tcl.
avanzando en rails con dificultad, a los tropezones, no es facil, pq
no estoy haciendo ningun curso por ahora sino que estoy siguiendo la
lectura del manual.
*** [2020-06-17 mié]
:LOGBOOK:
CLOCK: [2020-06-17 mié 17:45]--[2020-06-17 mié 19:27] =>  1:42
CLOCK: [2020-06-17 mié 15:58]--[2020-06-17 mié 17:15] =>  1:17
CLOCK: [2020-06-17 mié 11:00]--[2020-06-17 mié 12:27] =>  1:27
CLOCK: [2020-06-17 mié 10:14]--[2020-06-17 mié 11:00] =>  0:46
:END:
estoy en un bache con rails, quiero tratar de avanzar despacio
aprendiendo solidamente con las guias.
sigo con el trabajo sobre tcl-postgres
*** [2020-06-18 jue]
:LOGBOOK:
CLOCK: [2020-06-18 jue 15:00]--[2020-06-18 jue 17:33] =>  2:33
CLOCK: [2020-06-18 jue 10:22]--[2020-06-18 jue 12:56] =>  2:34
:END:
ayer estuve a punto de abandonar rails, y leyendo descubri que
desarrollar un SPA no es una buena idea, que requiere mucha
programacion, que es dificil de mantener y que contiene muchos
errores, por lo cual en el fondo es inseguro para algo como lo que
necesitamos nosotros.
A decir del articulo: con rails se obtiene el 90% de la funcionalidad
del spa con el 10% del trabajo.
Luego me puse a analizar los distintos lenguajes de plantillas y vi
que aparte de erb estan slim y helm como para lograr una escritura
mucho mas fluida, p.e. con slim.
Hoy despues de cansadoras dos horas y media felizmente descubro la
forma de usar directamente los models dentro de las view con solo
nombrarlos, eso es muy fuerte pq tenes el acceso a todos los datos de
una.
Hice mi datalist rudimentario pero no lo puedo linkar al modelo que
tiene rails de vinculacion campo/edit/new mediante form_for, y a la
vez veo dos cosas, que en un lugar dicen que usar datalist para
autocomplete no esta bien, y segundo que hay muchas repuestas en
internet sobre autocompletado para rails, o sea que habra que meterse
en ello con tiempo. o con mas conocimiento.
Ya vere la forma de conectar input directo a los objetos para hacer un
edit o un new, o hare mis propios forms para eso que no sean los
basicos que provee la interface.
Con muchos altibajos con muchas trabas pero saque adelante un cuadro
de busqueda medianamente lindo en boostrap y funcional para ver,
arregle tambien la tabla que no se veia bien y era pq estaban unidas
dos tablas y eso desastraba todo.
Queda por definir en larga encamada, slim-helm batalla final solo
teorica, aprender mas slim segunda lectura profunda, y leer simple
form, y leer de nuevo form en rails.
pq me da ganas de volver al erb pero da lastima perder la elegancia y
simplicidad de slim.
y no olvidemos que permite poner html o sea que si algo no funca lo
ponemos directo y listo.
*** [2020-06-19 vie]
:LOGBOOK:
CLOCK: [2020-06-19 vie 16:20]--[2020-06-19 vie 18:06] =>  1:46
CLOCK: [2020-06-19 vie 12:20]--[2020-06-19 vie 13:01] =>  0:41
CLOCK: [2020-06-19 vie 11:25]--[2020-06-19 vie 12:19] =>  0:54
CLOCK: [2020-06-19 vie 10:15]--[2020-06-19 vie 11:23] =>  1:08
:END:
la idea es volver a erb, pienso que slim es lindo pero agrega una capa
de posibles errores incomprensibles o sea no debugueables, y tiene
poca documentacion, y como es con indentacion con una pagina grande
tambien sera dificil de mantener. 
creo que con erb tenes una capa menos, y aparte todos los ejemplos en
todos lados estan con erb. Medio como que pasarse a slim sin dominar
el tema es medio complicado.
1hs- pase a ERB, con dificultades desinstale todo slim. puse
simpleform en bootstrap. o sea que ahora estoy en
rails-erb/simpleform/bootstrap tengo la tabla bien, tengo el crud
bien, tengo la busqueda bien. Tendria que encarar el ajax que vi los
videos hoy y pasar a pulir tcl.
1hs agregue div-container a las los forms edit y new y ahora se ven
bien, con simpleform-bootstrap, tambien pase el form que estaba en
erbpuro a simpleform. puse los combos de barrio y zona e hice una
practica extensa sobre el uso real de los tres combos y los veo muy
usables en una hipotesis de uso complicada como puede ser la seleccion
de calles/barrios/zonas, en especial calles con 3000 selecciones, y
veo que tiene una fluidez muy grande y suficiente para todo uso, solo
en el caso de las mnas te obligaria a buscarla en forma de combo
velozmente pero estan ordenadas lo cual no es tan gravoso y
representan menos del 5% de las ventas. el resto va como un tiro casi
sin usar la seleccion con el raton salvo quizas para algun
general. Mas trabado resulta la "solucion" tcl que te traba con los
nombres iguales. Por eso no creo que tenga que seguir insistiendo en
buscar un autocompletado para eso.
40min hice forms horizontales!!!!
1:45hs hoy hice un avance gigante pq practicamente he conseguido en un
dia poner en visualidad los formularios de crear y editar cliente con
bootstrap de una en un momento. Aparte esos formularios andan fenomeno
con el backend, o sea las validaciones se hacen solas y todo es muy
solido, Es mas no tengo codigo sino que es todo hecho con ruby-erb.
tambien en el dia de hoy gane el hecho de lograr el array de
calles/barrios/zonas muy agilmente y de hacer los selects, y darme
cuenta que con los select estoy listo. Por eso ahora estoy en hacer la
union entre clientes y venta, y lo quiero hacer a traves de la
pertenencia o sea que se pueda hacer de una por las relaciones, asi
como por venta pertenecer a clientes se armo todo el rutaje, quiero
que al hacer una venta nueva se cargue en forma mas que segura todo.
Un dia de claro avance.
Al menos en el micro-nivel al que habia llegado con laravel, no al que
tengo que llegar para reemplazar tcl, pero paciencia. Hablamos de tres
meses para tener la spa, y solo llevamos mes y medio si tenemos en
cuenta todo el tiempo, lo peor es el aprendizaje creo que cuando sepa
mas de todo voy a andar muchisimo mas rapido.

*** [2020-06-20 sáb]
:LOGBOOK:
CLOCK: [2020-06-20 sáb 17:05]--[2020-06-20 sáb 17:29] =>  0:24
CLOCK: [2020-06-20 sáb 16:10]--[2020-06-20 sáb 17:02] =>  0:52
CLOCK: [2020-06-20 sáb 13:56]--[2020-06-20 sáb 15:22] =>  1:26
CLOCK: [2020-06-20 sáb 13:12]--[2020-06-20 sáb 13:31] =>  0:19
:END:
Pude lograr pasar ventas, tener el formulario de pasar ventas, linkado
a un cliente con los metodos new y create funcionando correctamente, y
tambien en el metodo show de clientes agregue una tabla con las
ventas. 
La solucion de datapicker de html5 es satisfactoria y rapida, en
firefox es mas linda que cualquier datapicker que hubiese imaginado.
Me falta ver como podria agregar el detalle de articulos a la venta
generada y eso va a ser un poco complicado y va a requerir bastante
mas estudio.
Lo bueno de esto es que visualmente esta a un 95% de lo que queria y
practicamente sin esfuerzo o sea se hace solo, en ese sentido un gran
clap para html5 y bootstrap, y el background de rails funciona muy
solido pero hay que entenderlo para que rinda bien. Creo que una
aplicacion solida asi con rails es de confianza y tambien servira bien
a su proposito. 
La rapidez es como decia ese tipo es como un spa, falta el delay de
consulta en la nube, pero eso lo sufren todos.
*** [2020-06-22 lun]
:LOGBOOK:
CLOCK: [2020-06-22 lun 13:59]--[2020-06-22 lun 15:51] =>  1:52
CLOCK: [2020-06-22 lun 12:42]--[2020-06-22 lun 13:15] =>  0:33
CLOCK: [2020-06-22 lun 11:38]--[2020-06-22 lun 12:00] =>  0:22
CLOCK: [2020-06-22 lun 10:26]--[2020-06-22 lun 11:28] =>  1:02
:END:
enteramente dedicado a flask
*** [2020-06-23 mar]
:LOGBOOK:
CLOCK: [2020-06-23 mar 19:34]--[2020-06-23 mar 19:54] =>  0:20
CLOCK: [2020-06-23 mar 19:13]--[2020-06-23 mar 19:33] =>  0:20
CLOCK: [2020-06-23 mar 17:56]--[2020-06-23 mar 18:47] =>  0:51
CLOCK: [2020-06-23 mar 13:40]--[2020-06-23 mar 15:42] =>  2:02
CLOCK: [2020-06-23 mar 12:03]--[2020-06-23 mar 12:54] =>  0:51
CLOCK: [2020-06-23 mar 10:11]--[2020-06-23 mar 11:27] =>  1:16
:END:
dedicado a flask
19:34 retomo django
*** [2020-06-24 mié]
:LOGBOOK:
CLOCK: [2020-06-24 mié 19:52]--[2020-06-24 mié 20:18] =>  0:26
CLOCK: [2020-06-24 mié 18:01]--[2020-06-24 mié 19:45] =>  1:44
CLOCK: [2020-06-24 mié 14:10]--[2020-06-24 mié 14:55] =>  0:45
CLOCK: [2020-06-24 mié 13:24]--[2020-06-24 mié 13:43] =>  0:19
CLOCK: [2020-06-24 mié 11:35]--[2020-06-24 mié 12:35] =>  1:00
CLOCK: [2020-06-24 mié 10:24]--[2020-06-24 mié 11:34] =>  1:10
:END:
*** [2020-06-25 jue]
:LOGBOOK:
CLOCK: [2020-06-25 jue 19:47]--[2020-06-25 jue 20:08] =>  0:21
CLOCK: [2020-06-25 jue 15:35]--[2020-06-25 jue 17:23] =>  1:48
CLOCK: [2020-06-25 jue 13:15]--[2020-06-25 jue 13:29] =>  0:14
CLOCK: [2020-06-25 jue 12:23]--[2020-06-25 jue 13:13] =>  0:50
CLOCK: [2020-06-25 jue 10:06]--[2020-06-25 jue 12:05] =>  1:59
:END:
instalare pycharm:hecho.
*** [2020-06-26 vie]
dia dedicado al traslado de la oficina y adecuacion del lugar con una
nueva computadora con la instalacion del sistema
*** [2020-06-27 sáb]
:LOGBOOK:
CLOCK: [2020-06-27 sáb 14:00]--[2020-06-27 sáb 16:50] =>  2:50
CLOCK: [2020-06-27 sáb 11:30]--[2020-06-27 sáb 13:09] =>  1:39
:END:
comienza boludeo con vim-ide-python
*** [2020-06-28 Sun]
reinstalacion del sistema.
prueba con manjaro primero con openbox, luego instalacion en sistema
de manajaro-xfce, fallida por fallas en la impresora y en red y
complejidad en general del sistema. Y decantacion final por mint hasta
ahora muy satisfecho.
*** [2020-06-29 Mon]
:LOGBOOK:
CLOCK: [2020-06-29 Mon 19:25]--[2020-06-29 Mon 20:57] =>  1:32
CLOCK: [2020-06-29 Mon 18:33]--[2020-06-29 Mon 19:25] =>  0:52
CLOCK: [2020-06-29 Mon 12:49]--[2020-06-29 Mon 14:17] =>  1:28
CLOCK: [2020-06-29 Mon 11:03]--[2020-06-29 Mon 11:20] =>  0:17
:END:
hoy interrumpido por idas al Fede por rotura del auto no pude hacer
nada, solo instale lynx. 
Dia interrumpido por obra de pintura por devolucion de oficina.
Descubierta una pagina con buen material sobre ORM django para
estudiar desde alli. Estudiando y practicando directamente el orm.
1:30hs dedicado al programa mobil.Que creo que lo sacare rapido pq
sera una copia del programa anterior.
*** [2020-06-30 Tue]
:LOGBOOK:
CLOCK: [2020-06-30 Tue 19:00]--[2020-06-30 Tue 20:36] =>  1:36
CLOCK: [2020-06-30 Tue 11:50]--[2020-06-30 Tue 16:59] =>  5:09
:END:
puesta a punto en general con nvim y entorno de trabajo con buffers y
busqueda de archivos dentro del proyecto. Fueron claves ciertos
conceptos, como el que dijo que "proyecto" es una forma elegante de
decir carpeta (generalmente manejada por .git). Y como magistralmente
n3 con , hace la carpeta local, la hace proyecto, y luego con CtrlP
busco los archivos directamente en esa carpeta, y los buffers los
busco con CtrlB. Y aparte n3 da grandes funcionalidades de manejo de
archivos con creacion de dir o files con n, borrado con x, y cambio a
exe con *. Todo a la velocidad de la luz.
Desarrolle la app de calle sobre la base de mobile, ahora se llama
mob, pero esta funcional 100% y ubique todo en un repositorio mob en
gitlab.
instalado spacemacs para lidear con orgmode en modo vim. Y ver que pasa.
Emacs dooms espectacular. Lo mejor en este primer minuto.
** 2020-Julio
*** [2020-07-01 Wed]
:LOGBOOK:
CLOCK: [2020-07-01 Wed 19:25]--[2020-07-01 Wed 20:52] =>  1:27
CLOCK: [2020-07-01 Wed 15:59]--[2020-07-01 Wed 18:17] =>  2:18
CLOCK: [2020-07-01 Wed 14:09]--[2020-07-01 Wed 15:39] =>  1:30
CLOCK: [2020-07-01 Wed 13:28]--[2020-07-01 Wed 13:40] =>  0:12
CLOCK: [2020-07-01 Wed 11:54]--[2020-07-01 Wed 12:40] =>  0:46
CLOCK: [2020-07-01 Wed 11:34]--[2020-07-01 Wed 11:54] =>  0:20
CLOCK: [2020-07-01 Wed 11:32]--[2020-07-01 Wed 11:34] =>  0:02
CLOCK: [2020-07-01 Wed 11:03]--[2020-07-01 Wed 11:32] =>  0:29
CLOCK: [2020-07-01 Wed 10:43]--[2020-07-01 Wed 11:02] =>  0:19
CLOCK: [2020-07-01 Wed 10:36]--[2020-07-01 Wed 10:43] =>  0:07
:END:
puesta a punto de emacs-doom logre agrandar la letra, el theme no lo
cambio pq me gusta bastante, y pude arreglar los atajos para
orgmode-fechas.  tambien para ver los buffers abiertos.  Funciona a la
perfeccion en modo texto tambien. El modo python es casi mas claro que
en vsmode. Habria que ver que pasa con los otros modos que son
necesarios para escribir plantillas por ejemplo. Es como tener los dos
mundos mezclados. P.e. pones Cx y aparecen los atajos que uno
normalmente olvida, idem con C-c donde aparecen todos los atajos de
org mode pq estoy en orgmode en este momento.  Dos horas estudiando a
full django siguiendo el libro. Creo que es mejor, incluso puedo
imprimir y avanzar a la noche leyendo lo que despues voy a hacer. Creo
que es una buena practica. En cuanto al uso de los ides un poco para
cada lado, faltan mas dias de batalla. Y aprender un poco mas el tema
de proyecto o sea definir un proyecto y buscar los archivos
rapidamente para moverse en esa estructura. Ya descubri como asignar
carpetas a proyectos y es muy facil.  faltaria la busqueda dentro del
proyecto.  y aparentemente me salio bien el commit dentro de magit. Va
ahora otro para reforzar.
*** [2020-07-02 Thu]
:LOGBOOK:
CLOCK: [2020-07-02 Thu 18:38]--[2020-07-02 Thu 20:52] =>  2:14
CLOCK: [2020-07-02 Thu 17:27]--[2020-07-02 Thu 17:53] =>  0:26
CLOCK: [2020-07-02 Thu 13:47]--[2020-07-02 Thu 13:57] =>  0:10
CLOCK: [2020-07-02 Thu 12:39]--[2020-07-02 Thu 12:55] =>  0:16
CLOCK: [2020-07-02 Thu 11:15]--[2020-07-02 Thu 12:27] =>  1:12
CLOCK: [2020-07-02 Thu 11:03]--[2020-07-02 Thu 11:15] =>  0:12
CLOCK: [2020-07-02 Thu 10:01]--[2020-07-02 Thu 10:58] =>  0:57
:END:
descubierto spacevim. Vamos a ver la guerra con igualdad de
condicion. Tendra mas capitulos.  Batalla totalmente perdida hoy por
vim. una verguenza atroz. un engorro de proporciones epicas. Ni
siquiera pude hacer andar spacevim, totalmente trabado y
problematico. y el nvim puro no lo puedo hacer andar con proyectile,
pero no se para que lo quiero asi.  Me repliego y trato de usar el
nvim asi como lo tengo y veo que pasa. Si se me complica paso aqui.
Recien 11.15 comienzo con django despues de una hora diez con el
reniegue. Demasiado pienso en las herramientas.
*** [2020-07-03 Fri]
:LOGBOOK:
CLOCK: [2020-07-03 Fri 20:10]--[2020-07-03 Fri 21:33] =>  1:23
CLOCK: [2020-07-03 Fri 18:30]--[2020-07-03 Fri 19:21] =>  0:51
CLOCK: [2020-07-03 Fri 15:26]--[2020-07-03 Fri 17:26] =>  2:00
CLOCK: [2020-07-03 Fri 14:59]--[2020-07-03 Fri 15:16] =>  0:17
CLOCK: [2020-07-03 Fri 14:49]--[2020-07-03 Fri 14:59] =>  0:10
:END:
hoy la batalla se inclino fuertemente hacia el lado de emacs.
bellisimo theme, muy convincente modo de python para trabajar y nada
mas.
Ahora estoy teniendo un problemilla que no se si es de emacs o es de
teclado.
Luego de reinciar vere que pasa lo mismo hay un delay, no es algo
fluido.
Esta bastante focalizado en org el problema, no en los otros tipos de
archivos.
*** [2020-07-04 Sat]
    :LOGBOOK:
    CLOCK: [2020-07-04 Sat 18:33]--[2020-07-04 Sat 19:25] =>  0:52
    CLOCK: [2020-07-04 Sat 12:50]--[2020-07-04 Sat 13:10] =>  0:20
    CLOCK: [2020-07-04 Sat 12:34]--[2020-07-04 Sat 12:50] =>  0:16
    CLOCK: [2020-07-04 Sat 12:05]--[2020-07-04 Sat 12:34] =>  0:29
    CLOCK: [2020-07-04 Sat 11:57]--[2020-07-04 Sat 12:01] =>  0:04
    CLOCK: [2020-07-04 Sat 11:33]--[2020-07-04 Sat 11:57] =>  0:24
    CLOCK: [2020-07-04 Sat 10:13]--[2020-07-04 Sat 11:33] =>  1:20
    :END:
instalando ido-mode,web-mode. No hicieron nada nuevo en realidad.
Pero creo que se podra trabajar lo mismo por ahora. 
Lo unico exasperante y problematico lamentablemente es el delay
increible en el orgmode pro.org no le encuentro sentido siendo que con
emacs hemos trabajado bien siempre. Por lo menos he localizado que el
problema es con este solo archivo no con ali.org pe que tiene el mismo
tamaño.
Aparentemente el problema del delay se debe a la tabla resumen. Pq el
archivo pro. es chico comparado a otros y no tendria porque delayar.
pero sacandole la tabla generada todo ok.
Puede ser debido a la version de org. Eso es cambiante.
De todos modos cambie y puse en otro archivo doc.org la documentacion.
*** [2020-07-05 Sun]
    :LOGBOOK:
    CLOCK: [2020-07-05 Sun 17:29]--[2020-07-05 Sun 20:03] =>  2:34
    CLOCK: [2020-07-05 Sun 11:28]--[2020-07-05 Sun 12:15] =>  0:47
    :END:
*** [2020-07-06 Mon]
    :LOGBOOK:
    CLOCK: [2020-07-06 Mon 19:07]--[2020-07-06 Mon 20:33] =>  1:26
    CLOCK: [2020-07-06 Mon 18:00]--[2020-07-06 Mon 19:07] =>  1:07
    CLOCK: [2020-07-06 Mon 14:51]--[2020-07-06 Mon 16:15] =>  1:24
    CLOCK: [2020-07-06 Mon 13:36]--[2020-07-06 Mon 14:51] =>  1:15
    CLOCK: [2020-07-06 Mon 12:31]--[2020-07-06 Mon 13:11] =>  0:40
    CLOCK: [2020-07-06 Mon 11:54]--[2020-07-06 Mon 12:18] =>  0:24
    CLOCK: [2020-07-06 Mon 10:50]--[2020-07-06 Mon 11:54] =>  1:04
    :END:
una hora con hl y ahora empiezo con dj. termine el cap 3 del libro y
ahi termino el blog. y empieza un nuevo proyecto, y vi un par de
videos de la serie que venia viendo pero vuelvo al libro pq me parece
de superior calidad.
*** [2020-07-07 Tue]
    :LOGBOOK:
    CLOCK: [2020-07-07 Tue 17:45]--[2020-07-07 Tue 19:38] =>  1:53
    :END:
*** [2020-07-08 Wed]
    :LOGBOOK:
    CLOCK: [2020-07-08 Wed 18:48]--[2020-07-08 Wed 20:22] =>  1:34
    CLOCK: [2020-07-08 Wed 17:00]--[2020-07-08 Wed 18:20] =>  1:20
    CLOCK: [2020-07-08 Wed 15:27]--[2020-07-08 Wed 16:14] =>  0:47
    CLOCK: [2020-07-08 Wed 11:11]--[2020-07-08 Wed 12:30] =>  1:19
    :END:
*** [2020-07-09 Thu]
    :LOGBOOK:
    CLOCK: [2020-07-09 Thu 18:00]--[2020-07-09 Thu 18:32] =>  0:32
    CLOCK: [2020-07-09 Thu 17:40]--[2020-07-09 Thu 17:59] =>  0:19
    CLOCK: [2020-07-09 Thu 11:57]--[2020-07-09 Thu 12:57] =>  1:00
    :END:
*** [2020-07-10 Fri]
dia perdido en re-instalacion de mint-cinnamon en la compu vieja.
Y luego en breves practicas que no fueron cuantificadas.
*** [2020-07-11 Sat]
    :LOGBOOK:
    CLOCK: [2020-07-11 Sat 18:25]--[2020-07-11 Sat 20:25] =>  2:00
    CLOCK: [2020-07-11 Sat 13:26]--[2020-07-11 Sat 17:40] =>  4:14
    CLOCK: [2020-07-11 Sat 11:27]--[2020-07-11 Sat 12:45] =>  1:18
    :END:
Hoy fue un dia mas que satisfactorio, aunque lo veo asi recien al ir
cerrando la jornada, con el aprendizaje que me he planteado desde
abajo con ruby puro.
*** [2020-07-12 Sun]
    :LOGBOOK:
    CLOCK: [2020-07-12 Sun 17:40]--[2020-07-12 Sun 20:37] =>  2:57
    CLOCK: [2020-07-12 Sun 16:55]--[2020-07-12 Sun 17:15] =>  0:20
    :END:
Jornada bastante aplicada al estudio sin distracciones, ni
desasosiegos, a pesar de que estoy en los comienzos y habria razones
para desalentarse. Y hubo dos momentos de riesgo felizmente sorteados,
uno mas grande a la mañana por evitar largar ya con el desarrollo de
Hanami sin terminar de ver basico de ruby, y el otro hace un rato
cuando evite instalar tk pq esta ya obsoleto y no se puede instalar en
ubuntu 20.04. Siendo que tampoco el desarrollo del gui, que es un tema
distractivo tambien, me aparte del conocimiento mas basico del
lenguaje a fondo.
La idea es tratar de llegar a las 7hs en maquina con el proceso de
estudio que vengo implementando ahora y las lecturas anexas hacerlas
de temas generales de computacion, pero que no me aparten del camino.
*** [2020-07-13 Mon]
    :LOGBOOK:
    CLOCK: [2020-07-13 Mon 19:45]--[2020-07-13 Mon 22:30] =>  2:45
    CLOCK: [2020-07-13 Mon 17:55]--[2020-07-13 Mon 18:53] =>  0:58
    CLOCK: [2020-07-13 Mon 15:10]--[2020-07-13 Mon 16:30] =>  1:20
    CLOCK: [2020-07-13 Mon 12:09]--[2020-07-13 Mon 13:12] =>  1:03
    :END:
la primer hora termino el capitulo 3 e inicio el chapter 4.
2:45 perdidas en "nuevo" cambio de sistema
*** [2020-07-14 Tue]
    :LOGBOOK:
    CLOCK: [2020-07-14 Tue 18:03]--[2020-07-14 Tue 20:03] =>  2:00
    CLOCK: [2020-07-14 Tue 17:00]--[2020-07-14 Tue 17:46] =>  0:46
    CLOCK: [2020-07-14 Tue 14:15]--[2020-07-14 Tue 16:57] =>  2:42
    CLOCK: [2020-07-14 Tue 10:56]--[2020-07-14 Tue 12:56] =>  2:00
    CLOCK: [2020-07-14 Tue 09:56]--[2020-07-14 Tue 10:39] =>  0:43
    :END:
43min terminada la instalacion de Mate-LTS
para mejorar mi experiencia de trabajo propongo dos mejoras: sacar el
cable y poder cerrar la puerta, y poner el workrave para evitar pasar
demasiado tiempo sentado.
2:42 encare por otra direccion, desvarie viendo google cloud y ahi
observe que se fueron al caño aumentando el servicio a 100
u$s. inmediatamente lo di de baja. Y vi un servicio que arrancaba
desde los 4.5 dol para mysql y me pregunte pq habia fracasado con
mysql. Y lo concreto era la rapidez de carga desde sqlite a mysql y me
dije voy a resolverlo. Y ya lo resolvi, el quid estaba en las
transacciones eso lo ralentizaba mortalmente.
En el medio lamentablemente no puedo hacer andar adminer.
mysql trabaja aun mas rapido que postgres o igual, faltaria el
desarrollo para ponerse a la par.
2hs perdidas en el nuevo cambio de maquina, o sea que entre ayer y hoy
son casi 5 horas o mas perdidas en un cambio de ida y vuelta
totalmente innecesario. (la unica diferencia es que ahora esta
encriptada)
*** [2020-07-15 Wed]
    :LOGBOOK:
    CLOCK: [2020-07-15 Wed 10:30]--[2020-07-15 Wed 12:30] =>  2:00
    :END:
primera aproximacion a php, puse en marcha el servidor php -S para
trabajar directamente en un archivo php y ver el resultado en el
browser, voy practicando rapidamente con ww3.schooll. como primera
aproximacion.
*** [2020-07-16 Thu]
    :LOGBOOK:
    CLOCK: [2020-07-16 Thu 20:32]--[2020-07-16 Thu 21:35] =>  1:03
    CLOCK: [2020-07-16 Thu 17:30]--[2020-07-16 Thu 20:30] =>  3:00
    CLOCK: [2020-07-16 Thu 13:20]--[2020-07-16 Thu 16:40] =>  3:20
    CLOCK: [2020-07-16 Thu 12:45]--[2020-07-16 Thu 13:00] =>  0:15
    :END:
instalo mysql 5.7- via reinstalacion general del ubuntu 18.04.
primero: reviso las tablas nuevamente, las hago en workbench y obtengo
un nuevo script depurado de createtable de todo el sistema nuevo, sin
campos superfluos, sin tablas superfluas.
Termine todo el tableado, con un script de drop y creacion de tablas
completo, que al menos permite el trabajo inicial. Pq quedara obsoleto
cuando con algun framework tenga un model que recree la estructura y
tenga que adaptar el llenador.
Ahora tengo que empezar con el llenador. ya estoy avanzando con
esto. Creo que mañana lo tengo. Y comienzo con el pasado de los
programas a mysql/tdbc
*** [2020-07-17 Fri]
    CLOCK: [2020-07-17 Fri 21:29]--[2020-07-17 Fri 21:36] =>  0:07
    CLOCK: [2020-07-17 Fri 20:02]--[2020-07-17 Fri 20:57] =>  0:55
    renegando con la base de datos
    CLOCK: [2020-07-17 Fri 18:57]--[2020-07-17 Fri 20:02] =>  1:05
    primeros pasos - controller - routing basico
    CLOCK: [2020-07-17 Fri 17:38]--[2020-07-17 Fri 18:29] =>  0:51
    codeignater comienzo-renegando para instalar-instalado
    CLOCK: [2020-07-17 Fri 16:30]--[2020-07-17 Fri 17:11] =>  0:41
    CLOCK: [2020-07-17 Fri 15:49]--[2020-07-17 Fri 16:20] =>  0:31
    CLOCK: [2020-07-17 Fri 14:18]--[2020-07-17 Fri 15:42] =>  1:24
    CLOCK: [2020-07-17 Fri 13:43]--[2020-07-17 Fri 13:53] =>  0:10
    CLOCK: [2020-07-17 Fri 13:16]--[2020-07-17 Fri 13:43] =>  0:27
1.24hs haciendo las tablas me canse, es un trabajo muy repetitivo y ya
lo hice un monton de veces, es mas fuerza bruta que otra cosa. Lo
bueno de todo es que mysql es ultrarapido. Es ironico que la otra vez
abandone el proyecto pq pensaba que era inexplicablemente lento e
inviable y era pq no habia puesto transacciones.
empezare con el traspaso de sistema.
Tambien tendria que empezar a bajar el sistema de windows para la otra
maquina para ir haciendo pruebas. para ver si el sistema funciona en
ambos mundos.
1.10 hs haciendo la traduccion de pg a tdbc::mysql no muy motivado pq
es muy complejo todo y no creo que tenga sentido hacerlo, o quizas si
no se. 
Buen inicio con codeigniter se lo ve abordable para la complejidad de
la tarea que tiene al frente que es unir la consulta a base de datos y
la presentacion de una vista dinamica. y todo se hace en php.
*** [2020-07-18 Sat]
    CLOCK: [2020-07-18 Sat 16:45]--[2020-07-18 Sat 17:29] =>  0:44
    terminada la primera etapa- hecho el formulario.
    CLOCK: [2020-07-18 Sat 15:54]--[2020-07-18 Sat 16:41] =>  0:47
    comprension del funcionamiento controller/vista
    CLOCK: [2020-07-18 Sat 12:51]--[2020-07-18 Sat 13:24] =>  0:33
    seguimos con codeigniter-decifrando codigo-
No es mucho lo que hice hoy pero estoy encuadrado pienso, tanto en la
teoria basica de php, releer y aprenderse bien w3.schooll-php, como en
el framework que ya hice el inicio y sente el primer ladrillo ahora
falta leerse toda la documentacion y posiblemente seguir con los
videos que encuentre, hasta poder empezar con las practicas propias
donde empezar a desarrollar.  Veremos si puedo atravesar el punto
omega de los frameworks.
Por lo menos php me gusta, me gusta pq tiene su parentezco con tcl, y
su similitud con javascript, por lo cual pienso que es supernecesario
saberlo.

* Anotaciones
** Objetivos
*** tener la base de datos en la nube
*** tener mejores datos
** Ideas
*** orden de trabajo
primero lograr la base postegres funcionando en la maquina localmente,
pq ya sabemos que funciona en la nube (eso ya lo probamos el año
pasado). Aunque se podria reprobar en algun punto.
luego reescribir todos los programas con nuevos paradigmas.
*** nuevo paradigma de programacion
hacer una base que tenga un menu y una pantalla limpia con una barra
de busqueda arriba, tipo navegador. y de acuerdo a lo que necesitemos
despleguemos en la pantalla los datos en forma mas dinamica, quizas
usando como base canvas o edit o web y con los menus salgamos con
toplevels a hacer funciones extras. De paso puedo ir revisando todos
los programas actuales para ver lo que realmente se usa de lo que no
se usa, y lo que se usa hacerlo bien, o rehacerlo de otra forma o de
la misma forma pero mas simple quizas. 
*** paciencia con el trabajo
tener este log en el directorio nuevo, comenzar de nuevo, loggear
tiempo de trabajo y resumen de avance dia a dia, y llevar un registro
exacto de bugs y TODOs.
[2020-05-09 sáb] se trabaja muy  mucho a veces se toman caminos
equivocados en los cuales se pierde mucho tiempo, pero en el camino se
aprende mucho, nada se pierde creo, salvo la salud corporal en el
proceso continuo sin descanso. Pero creo que vamos a salir adelante.
** Idea de usar TCL como muleto                                         :TCL:
o sea hacerlo entrar en produccion mas o menos rapidamente, y tenerlo
como segunda opcion para cualquier cosa tener dos sistemas funcionando
y no depender solo de un sistema que recien estamos aprendiendo y nos
cuesta tanto aprender.
[2020-06-08 lun] el tema es que el desarrollo se pueda hacer mas o
menos rapidamente. que no lleve una excesiva cantidad de tiempo.
** Idea de estudiar Ruby                                               :Ruby:
[2020-07-10 Fri] la idea venia dando vueltas hace rato. Estos dos
meses y pico he dedicado muchas horas al estudio pq basicamente no
tengo otra cosa y como trabajo poco y el trabajo se hace en la casa y
se fusiona en tiempo y forma con la actividad y ademas es focalizado,
y no me lleva mas de digamos dos horas como mucho, y ademas no tengo
muchas obligaciones familiares. Como resultas de todo lo dicho tengo
mucho tiempo libre para malgastar o para dedicar a algo bueno. Esto me
parece bueno para mi, pq no solo que me distrae sino que hace que mi
mente se active. 
Pase por varias faces, primero creo que el primer mes cuando no
habiamos cerrado la oficina y era una carrera por aprovechar el poco
tiempo que tenia de este recreo que significaba la pandemia, el
objetivo era sacar un sistema operable. Luego el apuro quedo en la
nada cuando salto la idea del sistema muleto o sea hacer algo en tcl
provisorio y de respaldo que funcione bien mientras con tiempo
programabamos algo mas permanente, pero luego el tiempo paso y no
toque mas el proyecto pq no tuve tampoco apuro en sacarlo, pq pense
que ponerlo en funcionamiento en la red significaria que mi trabajo
quedaria seriamente comprometido, pq bien podria quedarme sin el
pasado de los papeles en el caso de que el Fede le resultara mas facil
ponerse a pasar los papeles en su casa que venir aca a traermelos a
mi.
Y en un escenario asi, mientras mas lejos y desdibujada este la chance
de tener algo de la web, como quedo parado, mal.
Luego vino la cancelacion del local, y al menos la perspectiva de que
no hay donde volver a trabajar. Que el salir yo a la calle a trabajar
o mutar de lo que estamos haciendo ahora solo podria darse mediando
circunstancias extraordinarias. 
Ahora desde el punto de vista de la programacion, veo que el primer
mes aprendi con laravel, no reniego de eso, y renegue bastante mas que
todo con los frontends. Y creo que hice bien en pasarme a rails, y
logre algo bueno en pocos dias, pero cuando choco con una dificultad o
sea ese muro de falta de conocimientos, que en laravel era bastante
general, y en rails fue el hacer el detalle de venta a la vista venta,
en vez de profundizar ahi, cambie de framework, y ahi estuvo el error.
pq django me parecio lindo al principio pero me hizo perder mucho
tiempo, pq el aprendizaje fue hecho no por el lado del crud, como en
laravel/rails que son bastante similares, sino por otro tipo de pagina
(un blog) y querer aplicar esos conocimientos a mi crud era muy
dificil. Luego de bastante reniegue con django no fui capaz de tener
ni un solo formulario propio ni mas elemental. 
Pero luego de considerar que django fue un error, a pesar de lo lindo
que se veia, y volviendo a la dupla laravel/rails como hermanos
gemelos, en ambos tenia el mismo problema, mis conocimientos de php
son 1.5 del 1 al 10 y de ruby del 3 de 1 al 10. Una cosa es copiar y
consultar lo mas minimo otra cosa es saber programar en el lenguaje
base. 
Por eso pienso que quiero aprender a programar en ruby desde cero y
bien, o sea aprenderme todos los trucos, y agarrarle practica. Tendria
que tener hecho unos 100 programas, ponele que no haga tantos, que
haga 20, pero tengo que tener conocimiento en ruby. Y eso me va a
llevar a tener mas conocimientos en programacion tambien, en
algorritmos, pq eso nada.  Despues la pagina va a salir sola.
Veo que tengo varios dias con 7horas de maquina, mas una hora a la
mañana y una hora a la noche de lectura, te da unas posibles 50 horas
por semana. 200 al mes. En un par de meses tengo qeu lograr el objetivo.
** Sobre los cambios de S.O.
ayer [2020-07-13 Mon] sucumbi nuevamente a la tentacion de otro cambio
de s.o. luego de solo 3 dias!! de haber hecho un cambio. Esta vez
supuestamente por un downgrade a mint 19.3 basado en ubuntu 18.04 que
tendra LTS hasta abril-2023, por el hecho de que "se supondria" que
tendria soporte a software que ya no es soportado en la 20.04 como el
ruby-tk, y me decidi por mate en vez de cinnamon por que una
comparativa lo sindicaba como menor consumidor de ram, y de aspecto
similar. Y ya que hacia el cambio aprovechaba para poner encryptacion
de disco que en la anterior no habia puesto (esto es pq prefiero las
ventajas de la seguridad frente a la penalizacion de unos segundos mas
en el arranque.).
El tema es que no es banal el tiempo invertido en el cambio, y no
puede ser tomada tan rapidamente la decision o sea en cuestion de
minutos. 
** idea encarar php-mysql
o sea el clasico lamp, por una cuestion de disponibilidad de
servidores mas baratos.

* avance semanal
** semana [2020-06-07 dom]                 :Laravel:TCL:Postgres:Lumen:Rails:
a todo vapor con el comienzo del spa, y el cambio de frontend dejando
semantic ui por bulma-buefy. Mucho estudio pero no poderlo poner en
practica. recien el domingo empiezo con cierta dificultad y muchas
trabas, en especial en temas puntuales como el modal que me
recontratabo en Bulma-Buefy (no habia sido asi en Semantic) [pero bue
Semantic es tema totalmente cerrado, es imposible seguir con algo que
requiere una instalacion tan pesada y ademas no se esta desarrollando
mas. principalmente esto ultimo]. El autocomplete de Buefy tampoco me
funciona, lo cual es un poco desilusionante.
El sabado dia del cumpleaños habia sido pura lectura de jquery,
pensando encontrar el nirvana alli, con librerias que prometian justo
lo que necesitamos tanto en autocomplete como en datepicker pero todas
obsoletas, asimismo el domingo me lance a hacer un curso de jquery y
uno de CSS basico los cuales termine a los dos casi. Y me sirvio un
monton para el lunes poner casi a punto el pasarventas en el mismo
lugar en donde habia estado antes.
Y alli vino el momento revolucionario de la semana: el pensar que
podria desarrollar sobre la base de lo que ya tenia el TCL-postgres
como sistema que estuviera listo mucho mas rapido en produccion que
fuera mas seguro y manejable y en el futuro sirviera de
resguardo. Eran muchas ventajas para pocas horas que podria insumir el
proyecto siendo que gran parte ya estaba hecho y funcionando. Y asi
fue que martes, miercoles, jueves y viernes logre poner a punto gran
parte del proyecto, revisando la base de datos, haciendo mas triggers,
etc.
El Miercoles descubro LUMEN que es un microframework de Laravel y
empiezo a leer y a aprender sobre el, y a practicar un poco sobre
eso. 
Creo que la semana que viene tendria que terminar el proyecto y seguir
estudiando Lumen y Vue.
ULTIMO MOMENTO!!!! anoche me tope con ruby on rails y me pico el
bichito de volver a rails, me parece un camino mas corto que seguir
con laravel. Todos los conceptos aprendidos en laravel me
recontrasirven para rails.
** semana [2020-06-14 dom]                                       :Rails:Ruby:
inmersion en ruby. Las diferencias son que hay pocos videos, pocos
tutoriales y los que hay son muy viejos. Como que rails fue famoso 10
años atras con la version 3 y 4 y ahora en el 2020 nadie le da bola.
La documentacion oficial es muy dificil de entender, se aprende pero
cuesta mucho. (igual a laravel si hubiera tenido que aprender de
ahi). Hay libros de rails pero no los he conseguido.
Esta semana tambien fue una semana de grandes descartes o de grandes
simplificaciones que no se si vienen pq estoy cansandome de no tener
resultados o cansandome en general o bien pq estoy mas bien acertando
el camino mas directo
- SPA: un gran articulo leido en medium que daba cuenta sobre los spa
  vs rails puro y concluia que un spa es dificultoso de programar y
  mantener y propenso a errores aun para programadores profesionales,
  y no queremos esto para nuestra aplicacion de oficina, por eso alli
  quedo la necesidad de estudiar vue o mas recientemente react.
- Bulma y etcs: me quedo con Bootstrap que anda de facto con
  simpleform y anda perfecto de una, pretender diferenciarse con una
  opcion atipica como bulma me parece excentrico y
  dificultoso. problematico sin documentacion para hacer el binding.
- autocompletes: probe los selects que de una se producen con una
  linea de codigo en rails y son cien por cien funcionales a la hora
  del trabajo incluso diria que mas que los combos-mios-tcl.
Necesito aprender en forma mas basica y a fondo si quiero avanzar a
otros niveles, por eso creo que el libro de ruby bajado me va a servir
y seguir leyendo e investigando las guias rails a fondo hasta saberlas
todas. Hay buenos tutoriales en medium sobre rails que hasta ahora me
han servido y creo que por ahi pasa ir subiendo peldaño a peldaño.
** semana [2020-06-21 Sun]                           :Django:Flask:Vim:Emacs:
semana de Django. Luego del pico de rails de la semana pasada parece
que en el momento mas alto pica el bichito de lo nuevo y se me ocurrio
probar django a ver como era. POr dos motivos, primero por probar,
para ver, y segundo por la pretension interna de aprender algo a fondo
ir a fondo para adelante sin detenerme, y creo que el mundo python era
mas adecuado para eso. Django debo decir que me encanto desde el
primer momento, la pagina de inicio, el tutorial, etc. pero luego
entro el diletantismo, empece a ver los microframeworks y vi flask, y
me dedique por entero a un tutorial con flask y anduvo bien pero lo
veia muy complejo, incluso mas complejo que django, por eso el martes a
la noche dije hasta aca nomas y regrese a django, hice el tutorial de
nuevo y arranque, pero la semana estuvo muy cortada pq el dia jueves
me distraje mucho con el pycharm, y el viernes con el traslado de la
oficina, y la instalacion de la maquina nueva, nuevo sistema operativo
etc., en realidad estuve boludeando con eso hasta el domingo a la
noche, o sea tres dias. pero estoy conforme con el resultado al menos.
en el medio al menos he solidificado algunos conocimientos basicos
django que habia leido y habia practicado como para que me entren
bien. y no avanzar rapido pero sin base. Luego y mientras pasaba todo
esto vino la revolucion vim, la revolucion terminal, tmux (aplazada
por el momento), emacs en terminal, trabajar en terminal en pestañas,
hoy con lynx (abandonado) y demas. O sea una semana floja en avance
pero creo que cambie el entorno fisico de trabajo un monton, y tambien
hice unos cambios de entorno de base que veremos como funcionan.
** semana [2020-06-28 Sun]                               :Emacs:Vim:TCL:Mint:
en realidad la semana propiamente dicha va a empezar el martes, pq el
domingo estuvo perdido en boludeaje de instalacion de s.o. y el lunes
en obra de pintura del local.
Pero empezare a programar una aplicacion de celular.
No salgo del bache provocado por el cambio de maquina de sistema y de
lugar de trabajo, me volvi mas freaky y no salgo de eso, todavia se
que me tengo que volver mas productivo, ahora que el cierre de la
oficina se transformo en un hecho, es como que me dedique mas a la
herramienta.  primero con el cambio de sistema operativo, que al final
decanto en mint con el cual estoy reconforme. y luego con la vuelta a
vim y ahora con la recontravuelta a emacs y sus recontrafreaky
sistemas de tuneados con caracteristicas mixtas de emacs-vim. Y este
ultimo que he encontrado parece realmente bueno. Veremos lo que pasa.
La semana continuo en recontra perdida de tiempo con la puesta a punto
de un Emacs propio, con poco y nada de django, avanzando con el
trazado del libro pero con poco avance. Pero por lo menos me he
decantado por un editor.
Creo que esta fue la semana de la Guerra de los Editores. con la
puesta a punto de dos editores grandes. Poner a punto Emacs me llevo
bastante y Nvim tambien, y tambien en el medio perdi tiempo con el
doom.
** semana [2020-07-05 Sun]           :Django:Emacs:VSCode:Rails:Ruby:Hledger:
esta semana comienza ya con la herramienta establecida por lo tanto no tendria
que perder demasiado tiempo en cambios rotundos como la semana pasada salvo
perfeccionamientos menores.  siempre me da un reniegue nuevo el editor no
entiendo porque es el problema que tengo que resolver.  Cuando parecia que todo
estaba afinado y puesto a punto aparece un nuevo problema que me ocupa un monton
de tiempo y no se resuelve.[Solved aparentemente]
Como siempre y siguiendo la costumbre de los domingos, re-descubri
ledger y mas que todo la posibilidad de implementarlo con facilidad a
traves de la mano de hledger que permite ingresar las operaciones con
la terminal o ui o web. Asi se obtiene una contabilidad de otro nivel.
Estoy contento con emacs a nivel general pq complementa directamente
con orgmode y eso es fantastico. A la larga servira y mucho para
organizarse mejor. Pero hoy pensaba [2020-07-06 Mon] si el fanatismo
de emacs no es solo eso un fanatismo. Pero asi lo fuera no estaria
mal, pq es algo que tiene mucha historia en el mundo de la computacion
y uno no esta en el sitio del gran desarrollo sino que esta
aprendiendo. Y se esta divirtiendo. La pregunta hoy por hoy es si
seria mas productivo en vscode, probablemente si, pero aprenderia
menos, no me hace mal escribir codigo pq aprendes mas. En eso recuerdo
el video que vi si conviene al estudiante desarrollar con un IDE o
usar algo limpio.
Despues de terminar el proyecto del blog con el libro de django, pase
a otro libro mas chico y agil que presenta un material nuevo que es
como un boilerplate gigante en django, por ahora sigo pq se aprende y
mientras paso papeles sigo el curso de pildoras informaticas que
tambien es algo que aprendes, pq explica muy bien , muy de abajo y muy
simple. Por momentos me parece que django -o cualquier framework-
fuera algo gigante fuera de mi alcance. Y en si todo lenguaje de
programacion en general. Quizas se deba a la dispersion del metodo de
trabajo-estudio. o sea que no doy con un metodo de trabajo adecuado.
Creo que un metodo adecuado tendria que ser una teoria
leida-escrita-elaborada- y una practica consecuente a ese cuantum de
teoria.
O sea una mezcla de practica deliberada-armado-A4-repaso y una
practica sobre eso en maquina. Hasta ahora los metodos seguidos tanto
en laravel que fue seguir el video y hacer la practica, y en
rail/django seguir el libro me han introducido al tema pero con muchas
lagunas y sin saber como seguir o como hacer para adaptar lo aprendido
para algo propio.
[2020-07-09 Thu] hoy considero volver a usar vscode para el desarrollo
web pq se hace muy anti-productivo hacerlo en emacs, o sea el estar
cambiando y abriendo buffers a cada rato es un pain. Como experiencia
fue valida, incluso me quedo el emacs bien tuneado y reproducible con
solo hacer el ln -s en .emacs.d/ a la carpeta orgblok o sea mejor que
antes.
Pero puedo seguir con vscode pienso.
Bastante regular la experiencia con vscode. No fue tan lisa y llana
como pense. Quizas siga con emacs. 
Esta mañana habia tenido la idea de esqueletos de diseño. O sea
p.e. la estructura {% extends "base.html" %} etc se repite en todos
los templates, por lo tanto tenerlo como un boilerplate, y tambien se
podria tener uno tipo base.html, quizas con una extencion ~ o
adelante, y listo, el tema de los porcentajes ya me acostumbre a
escribirlos.
Pero mas adelante podria quizas aprender con yasnippet.
y depender de mi mismo.
Hoy a la tarde volvi a revisar RAils. Instalacion: 19
minutos. Reimplantacion del proyecto, totalmente lisa sin problema con
bundle install, y con yarn a pedido de la interface cuando hice el
rake db:migrate. Genere la base de datos y volvi a ver el sistema, que
estaba bastante avanzado comparando la nada absoluta en la que nado
con django. Si bien es cierto que ciertos conocimientos he adquirido
de django y tengo conocimientos de python, a nivel de resultados
productivos no tengo nada en absoluto. En Laravel en una semana saque
algo productivo incluso subido a heroku. Luego deambule por todos
lados con la interface. Y con rails fue muy liso lo logrado a nivel de
interface a pesar de la escasa documentacion a seguir (sin cursos de
video ni libro a seguir) y muy mucho lo conseguido y me trabe en la
parte detalle de venta que es una parte que trabaria cualquier
sistema, no solo rail en ese nivel, sino quiero verlo a django y
asimismo laravel. Tendria que hacer una pausa de un par de dias en
django y ver si puedo superar el bache que me trabo en rails y ver que
pasa. De todos modos creo que todos los conocimientos estan ahi, no se
pierden. (incluso creo que los de laravel deben estar)
[2020-07-10 Fri] Siendo que estoy a solo 24 hs de la reimplantacion de
rails y siendo que perdi todo el dia util en la reinstalacion de la
maquina vieja, bastante he recuperado de rails. He recuperado el
sistema tal cual lo deje en dos maquinas, o sea dos practicas, dos
instalaciones de rails, e incluso tomando como ejemplo lo hecho pude
mejorar una de las vistas que tenia a medio hacer. Me lei tres
capitulos del libro y pienso que puedo avanzar un poco aunque no
espero mucho de alli. Me parece solido, puede que se pueda ir
programando un sistema con el tiempo. 
[2020-07-11 Sat] ayer decidi que tengo que estudiar de abajo no hay
forma en este tipo de programacion de programar como lo venia haciendo
salvo retomar un proyecto tcl de nuevo y hacer todo de vuelta como lo
hice hace dos o tres semanas. Siendo que lo desarrollado con rails
esta ahi, no se perdio nada. Pero me planteo estudiar ruby a fondo muy
a fondo. lo cual incluye tambien a rails, para no hacerlo con cajas
negras ni copiando y luego no saber que tengo que hacer, como me
pasaba con django. Puede que demore mas pero es mas seguro.
Quiero aprender ruby desde los fundamentos a fondo, no importa cuanto
me lleve, y tengo que hacerlo leyendo detenidamente el libro escrito
por el maximo maestro del tema, Matz, y hacerlo en la compu pq ahi
articulo al irb para la practica de todos los conceptos hasta del mas
ridiculamente simple, y anoto en emacs en mi cuaderno documentario.
El cuaderno documentario termino haciendose mas que interesante hoy
con la incorporacion de los tags. hago el encabezado, escribo el
ejemplo o lo que sea, y lo tagueo, entonces luego va a ser facil
encontrar o aislar las partes maxime cuando no sabemos como se va a
estructurar o por si no me gusta la estructuracion, en este caso la
estructura la dara el tagueo.
** semana [2020-07-12 Sun]	     :Hanami:Ruby:Mint:mysql:php:CodeIgniter:
Anoche puse la busqueda ruby-web-framework y descubri hanami, y me
parecio en principio lindo por todo lo que prometia, luego leyendo una
documentacion muy bien presentada y entendible, lo veo abordable
dejando de lado los test, pero creo que no es el momento. No es el
momento de dejar el impulso de hacer la base de ruby. Pq incluso
hanami tiene muchos conceptos de ruby que no entiendo por eso, pq no
tengo base. O sea que despues de diplomarme en ruby estare listo ya
sea para rails o para hanami o para sinatra o el que sea.
El estudio se interrumpio final de tarde lunes comienzo del martes por
re-re-reinstalacion de Mint. Y tambien tuve la tentacion de cambiar el
orden de estudio, o sea dejar el denso libro que estoy siguiendo por
un tutorial mas light. Ahora no pienso que sea buena idea.
[2020-07-14 Tue] aparte de una nueva reinstalacion, la segunda en la
semana, que me quito minimo cinco horas, di un vuelco a desempolvar el
proyecto mysql. En un giro inesperado, el vuelco a mysql me llevo en
forma directa a php, y me volque rapidamente a ello, pienso que puedo
dominar lo palotes en poco tiempo y probar con codeignaiter. Pienso
mas que todo que cualquier servidor del mundo ofrece a bajo precio
mysql-php, y que esa plataforma ofrece las mejores condiciones para
lo que yo necesito hacer.
[2020-07-16 Thu] estoy entre la espada y la pared pq me planteo
encarar el desarrollo mysql-php en el siguiente orden mysql base de
datos normalizar sqlite3 totalmente eliminar triggers y
procedimientos, hacer la estructura con tcl, luego probarla con
windows paralelamente aca. Mientras tanto aprender php-codeignaiter y
terminar subiendo a la web.
El tema es que los servidores linux-web-hosting segun pude averiguar
trabajan por empezar con mysql 5.7 no con la 8, y ni siquiera con php
7.4 y no trabajan con triggers. O sea uno no sabe eso cuando programa
algo, se lanza, busca la ultima version y luego se encuentra con que
no es soportada y los triggers no son soportados. He leido suficiente
sobre lo oscuro y dificiles de mantener que son los trigger frente a
una logica de negocios hecha por los programas en si, y me pregunto si
use trigger/proc/func porque las necesitaba o porque estaban ahi y
habia que usar lo que el entorno de base de datos te daba. La otra
opcion es olvidarme de todo y seguir con php y postgres pensando que
voy a subir a heroku. Pero es depender de un solo proveedor y
extranjero frente a la posibilidad de poner la base en cualquier lado.
[2020-07-17 Fri] estoy reevaluando propositos pq creo que no estoy
evaluando bien la dimension de todo esto. O mas que todo lo que
significa traducir el sistema tcl a mysql encima con la limitacion de
hacerlo en tdbc pq tenemos la limitacion windows, o sea una tarea
enorme, y todo esto sin haber siquiera empezado a aprender php, ni el
framework no haber desarrollado nada que haga necesario la conexion
mysql-php. Es por lo tanto un momento dificultoso o de decision
dificil de saber que hacer, y en que emplearse. Increiblemente pasan
los dias y las semanas y estoy a fojas cero. Con crecientes
preocupaciones.
Termina la semana tranquilo al menos encuadrado en una nueva idea que
es meterle al php.

* agenda emacs
** [2020-07-04 Sat]
*** powerline
*** ido-mode 
puesta a punto
*** busqueda en buffer con Cx b
a traves de ido en forma facil y rapida
*** Cx s
para ver que buffers necesitan ser
salvados en un momento dado.
*** arregle el problema de los linum en orghook
y de python venv que causaban
enlentecimiento de los buffers grandes.
** [2020-07-05 Sun]
*** ag
ag-project para busquedas dentro del
project actual.
*** bookmark
para archivos que necesitamos acudir
frecuentemente p.e. init.el
*** busqueda tipo %/* F8
con el comando adhoc
xah-search-current-word bindeado a
F8
*** dired Cx-Cj para subir de directorio
gracias a (require 'dired-x)
*** descubrimiento de mouse-8 y mouse-9
pero aun no bindeados
** [2020-07-06 Mon]
*** Mx-shell Mx-ehell
aunque eshell es mas coloreado y lindo shell es bash puro y ejecuta el
venv.
*** mayor uso de Cf y Cb para evitar las flechas
el Cf lo vengo usando mucho y ahora empiezo con el Cb
*** dired R rename + crear directorio
*** M% para buscar y reemplazar
** [2020-07-07 Tue]
*** Md para borrar palabra 
*** Cd para borrar un caracter
** [2020-07-11 Sat]
*** Cc-Cq en org tags
*** C}-m buscar por tags
*** Cc-Cl en org link
pone link luego descripcion
o pone file: y luego elige el archivo y hace un hiperlink
** [2020-07-12 Sun]
*** CcCs Scheduled en orgmode
y poniendole adentro +1 hacemos el vto periodico
* agenda linux general
** firefox
*** [2020-07-05 Sun]
**** aceleracion de mouse-whell
In the URL bar, type about:config, press Enter.

    set mousewheel.acceleration.start to 2. (default is -1)
    set mousewheel.acceleration.factor to 20. (default is 10)
** ln -s
simbolic links (ojo -s no s)
mediante ln -s y siguiendo una idea que escuche el otro dia en un
video puse un par de dotfiles (init.el y .hledger.jornal) en la
carpeta orgblok que esta en git y es activamente mantenida y por lo
tanto esta bajo control de version asegurada. Y mantengo soft links en
el lugar necesario.

ln -s path-del-archivo-real  path-del-soft-link
** tree
comando tree para ver la estructura del arbol del directorio. Le hice
un alias para ignorar los pyc pycache y los ~ # de emacs.

* agenda hledger
** inicio [2020-07-05 Sun]
muy rapido y facil.
** arreglo de cuentas y directivas
Y2020 para establecer el año por defecto
D $1000.00 para establecer el producto por defecto
account ... ; type:Asset
para establecer el plan de cuentas y la tipologia de cuentas para que
se presenten en los informes.
*** tipos de informes 
**** hl b caja - hl b
**** hl register caja
**** cj (hl r caja)
que viene a ser una forma rapida de consultar el saldo y a la vez de
ver los ultimos movimientos.
** cuestion con hl r caja
paso muchos asientos por el pago de la tarjeta y no me daba la caja, y
luego de revisar todo detalladamente, corrigiendo un error encontrado,
el error inexplicable persistia. Viendo la salida de cj veo que
tambien sumaba el asiento de seguro la caja, lo cual obviamente
distorsionaba el calculo, por lo cual, cambie a algo mas preciso:
hl r assets:caja y dio bien independientemente de que una cuenta
contenga caja en su nombre.
** downgrade a version 1.2 [vuelta atras]
diferencias:
1. no admite la directiva account, por lo cual tengo cuentas en ingles
2. no admite la abreviatura b para balance pq tiene dos comandos
   similares balance y balancesheet, por lo cual hay que poner balance.
* agenda mint
** [2020-07-07 Tue] aparece mensaje de error al arranque
casi al dia siguiente de haber cambiado a uso de controlador nvidia
por sugerencia del mismo sistema
[2020-07-09 Thu] lo mismo sigue haciendolo por mas que volvi al
controlador anterior.
** [2020-07-09 Thu] cambia el orden del icono de inicio
se posiciona despues de los pineados
despues del reseteado sigue igual
haciendo edit mode del panel lo restaure pero no se pq se puso.
** [2020-07-10 Fri] instalacion en hero-old
** [2020-07-13 Mon] instalacion de Mate Mint 19.3 hero-LTS
Mint 19.3 - Mate en hero-jujuy que tiene soporte oficial hasta mitad
del 2023!! y se habla de 5 años mas!! de soporte. Todo nacio pq hay
software que desaparecio en la version 20.04 y no tiene sentido
tenerla todavia cuando la otra esta vigente y hace lo mismo. Pero todo
es relativo. A poco de comenzar ya vi el primer problema de
compatibilidad con hledger que funcionaba perfectamente con el otro y
bajo aca, cambiando ciertas caracteristicas obligandome p.e. a tener
las cuentas en ingles. No gran cosa pero se van viendo diferencias.
** [2020-07-14 Tue] vuelta a Cinnamon Mint 20 como hero-20
** [2020-07-16 Thu] vuelta a Cinnamon Mint 19.3 como hero-19
volvi a 19.3 como obligacion o necesidad por tener que desarrollar
mysql 5.7 si o si por el proyecto que tengo, y las enormes
dificultades que encontre para instalarlo en 20.04, siendo que en este
se instala de una. En realidad una vez funcionando ambos sistemas
andan igual, uno se olvida. Esta fue la semana de las tres instalaciones.
